[
  {
    "author": "Matthew Moniz",
    "text": "If you own an iPhone 14 Pro or Pro Max hows your experience been? Also, if you missed it here&#39;s the best laptops of 2022 <a href=\"https://youtu.be/O1_aB6Y-dDE\">https://youtu.be/O1_aB6Y-dDE</a>"
  },
  {
    "author": "Diego Jose",
    "text": "Super happy with my 14 pro max. Just upgraded from a 2020 SE. so it was a huge difference for me. I feel like this phone will age well since it’s the first with a dynamic island and typical apple fashion it will become the standard over the next several years. Look at the notch  and how long it stuck around.<br><br>Things that I don’t like (which are just a few). <br>Always on display I feel like we are going to have burn in issues. The pixels don’t even shift unlike android where the pixels shift a bit to prevent it. I have mine off as I buy iPhones every 4+ years. Just want to make sure it last me as long as possible. <br><br>I wish the Dynamic Island did more. It’s a cool touch but you can tell it’s in early stages. It may take a few years for us to see its true potential. <br><br>That’s all there is to it. I overall love the phone love the size, the heft, and it’s screen."
  },
  {
    "author": "Prince Erick",
    "text": "What people fail to realize is that you can&#39;t use find my iPhone with a Samsung,Samsung has nothing like apple Music,can&#39;t FaceTime and the videos on YouTube and on the internet look so sharpen.and to mirror you have to go through so much BS.and the volume on aux/Bluetooth is way louder.<br>wake up people 👏🏻👏🏻👏🏻"
  },
  {
    "author": "Habibis",
    "text": "I just bought the samsung s23 ultra 3 days ago after putting my Samsung s10 plus to rest.i can tell u the samsung s23 is a beast but I think I am getting bored of android and never owned a iPhone in my life might return to try out the iPhone 14 pro max"
  },
  {
    "author": "Xiao",
    "text": "Great wallpaper! From where can i get it"
  },
  {
    "author": "Kolya Ursaki",
    "text": "I changed from 12 pro max to 14 Pro Max . OMG i love it!😍"
  },
  {
    "author": "Nature",
    "text": "Greet from Malaysia🇲🇾"
  },
  {
    "author": "Bulvine420",
    "text": "I don’t use a screen protector because I want my screen to look as best as possible! 2 seconds later. Is that a scratch? Fuck!"
  },
  {
    "author": "Orrin",
    "text": "Still waiting for an update for the macro mode. Phone seems to get confused on what lense to use. Gets annoying sometimes when I have to take pictures of plans and the phone spazzes out."
  },
  {
    "author": "Jose",
    "text": "Samsung mastered the &quot;Always in display. &quot;<br>Iphones are 5 years behind."
  },
  {
    "author": "Ondřej Tureček",
    "text": "Hey, iPhone 14 Pro owners without screen protector, how are you doing? I&#39;m not sure whether to put glass on my new phone...it will be in a case that has some kind of raised lip around display, but nothing extra, probably Spigen Liquid Air."
  },
  {
    "author": "Pedro Novak",
    "text": "Turned the always on display off the minute I started using the device after getting it. For the cameras I really don’t like the oversharpening thing, especially on night mode. I’ve ended up shooting most of the time on RAW and then I do the editing and export to jpeg using Lightroom mobile."
  },
  {
    "author": "Deadpool",
    "text": "This guy knows how to properly review a phone. A proper balance between showing the phone as well as his face when talking about it. What most reviewers do is they show their face for like 10 whole mins and keep talking about the phone instead of actually showing the phone. When I click a phone review video, I want to see the phone, not the reviewer&#39;s face. Period. I want to see the UI, as well as how the phone looks while holding on hand."
  },
  {
    "author": "TheDane",
    "text": "Have the 13 pro max and 23 ultra, watching hdr videos in youtube the 13 pro max looks brighter and more richer in colors 😅, maybe it the way the display is calibrated 🧐?"
  },
  {
    "author": "Yogi Nog",
    "text": "Getting the 14 pro max today from iphone xs"
  },
  {
    "author": "Timothy Weatherspoon",
    "text": "<a href=\"https://www.youtube.com/watch?v=lCT0LzQ9qRU&amp;t=5m22s\">5:22</a> is your RAM in slots right beside each other?"
  },
  {
    "author": "Rbasi",
    "text": "I hated mine and returned it, but I am glad you like yours."
  },
  {
    "author": "Don Flamingo",
    "text": "My battery is awesome on my 14 Pro Max"
  },
  {
    "author": "Denise Ajanel",
    "text": "Do you have any third party website recommendations to purchase the iPhone 13 Pro max?"
  },
  {
    "author": "austin mattingly",
    "text": "Guys please use screen protectors lol."
  },
  {
    "author": "YOU AINT HEAR IT FROM ME PODCAST",
    "text": "If you coming from a x or less it&#39;s a good upgrade but anything after that it&#39;s the same phone with slight upgrades you probably wouldn&#39;t notice"
  },
  {
    "author": "Sports Commentaries",
    "text": "Hi<br>I need a little bit of advice<br>I currently own an iPhone SE second gen and upgrading to an iphone 14 pro max.<br>I also own an IPad Minnie 6.<br>Which charger do i need for my iphone 14 pro max?<br>Do i need to buy anything?"
  },
  {
    "author": "Douglas Vaughn",
    "text": "Great reviews!"
  },
  {
    "author": "imicca",
    "text": "Absolutely agree with the camera. Sometimes I open the camera take a picture and put it in my pocket when I check it and the picture is not there. I think there’s some problem with opening the camera taking a picture the speed sometimes does not match"
  },
  {
    "author": "Deathly Shivers",
    "text": "Matthew Monica"
  },
  {
    "author": "Hennie Ferreira",
    "text": "I never use my cameras so i dont mind"
  },
  {
    "author": "𖤍𝟜ℝ𝕖𝕒𝕝𖤍",
    "text": "I have a question: if you are a gamer and you want a solid top tier photo phone, but video quality isn&#39;t that much important what do you choose? VIVO X90 pro plus or iPhone 14 pro max? I bought Chinese version of Vivo, but I&#39;m still curious about the answer."
  },
  {
    "author": "Ethan xd",
    "text": "I&#39;m going from a fold 4 to a 14 pro max..."
  },
  {
    "author": "Daniel Esquivel",
    "text": "Getting mines delivered on the 11 of January 14 pro max. Currently using iPhone 11. Time for a upgrade"
  },
  {
    "author": "Z R",
    "text": "What wallpaper is that?"
  },
  {
    "author": "Shankar Kumar chauhan ha so",
    "text": "Super so hii"
  },
  {
    "author": "Mark DeCesare",
    "text": "buying the 14 pro was the best decision of my life"
  },
  {
    "author": "kyrils Rezk",
    "text": "You know it is been 7 months And the reason i watch this video again is the Entro.<br> one of the greatest Entro i have ever seen in smartphone reviewers ❤️❤️💯"
  },
  {
    "author": "CesarEnglishTeacher Cesar7Peru",
    "text": "<a href=\"https://www.youtube.com/watch?v=SdLShOCvVeM&amp;t=14m17s\">14:17</a><br>The camera 📸🤳"
  },
  {
    "author": "Masisc Cases",
    "text": "can you turn this off lol seems like a waste of battery <a href=\"https://www.youtube.com/watch?v=SdLShOCvVeM&amp;t=7m48s\">7:48</a>"
  },
  {
    "author": "Masisc Cases",
    "text": "dynamic island is sweet but it is the same haha"
  },
  {
    "author": "leoninc",
    "text": "Nice review! 👍🏾"
  },
  {
    "author": "Mahendra Nannaware",
    "text": "Still waiting for the copied to flow in"
  },
  {
    "author": "Explore with Ghufran",
    "text": "Brother your production is next level.. really appreciated 🫶🏻❤️"
  },
  {
    "author": "Jane Kailey",
    "text": "How can you seriously consider using an iPhone for pro video / movie-making when none of them can function in hot sun. The screen keeps dimming more and more from the heat until it’s no longer visible and then it shuts down entirely. 🤣"
  },
  {
    "author": "Mohamed Sadat",
    "text": "Lol what accident car crash alert? 😂😂"
  },
  {
    "author": "Al and Martha Ballon",
    "text": "Young man, you are by far one of the very best bloggers on the net. Your depth of knowledge is explicit and the ability to translate tech stuff to daily vernacular - which many of us are in desperate need - is refreshing. Your strong on camera presence and verbal style are the cherry on the cake. Keep on, keeping on. I’m a 70 year old fan of your so you’re connecting with a wide audience 🏋🏻‍♀️"
  },
  {
    "author": "Adventures Of The Times",
    "text": "Ok, the satellite communications feature is absolutely bad ass for literally anyone, because what if people decide to venture and just go off grid hiking and then get lost? I&#39;d who you are or what you do. I think it&#39;s brilliant."
  },
  {
    "author": "Husam Haddad",
    "text": "Is the iPhone 14 pro max 1TB going to be in slow browsing if I add too many apps and pictures and videos in it or no ?"
  },
  {
    "author": "Lori W",
    "text": "I went from the X to the 14 Pro Max and I’m super happy. Big difference for me."
  },
  {
    "author": "Yuvraj Deshmukh",
    "text": "Feels awesome to watch this video on my “14 Pro Max”🤪😂😂"
  },
  {
    "author": "Jonathan Latouche",
    "text": "Sauf mwenm"
  },
  {
    "author": "BrickFull StudioZ",
    "text": "I came from a galaxy s4 then a iPhone 6s + and now I upgraded to the 14 pro"
  },
  {
    "author": "Jubal Harshaw",
    "text": "Your voice doesn&#39;t sound like it&#39;s your voice. Why?"
  },
  {
    "author": "Roeung Ra",
    "text": "❤ Happy Happy To Meet You Anytime Love You Forever ♾ !!! ❤"
  },
  {
    "author": "Mjaukatt",
    "text": "What wallpaper is that??? I neeeeeeeed it"
  },
  {
    "author": "keebafu",
    "text": "I love that you gave LG their flowers @<a href=\"https://www.youtube.com/watch?v=SdLShOCvVeM&amp;t=13m23s\">13:23</a> !"
  },
  {
    "author": "Edward Yeung",
    "text": "Marques&#39; longevity has been insane"
  },
  {
    "author": "Dan Parra",
    "text": "Just call it DI..."
  },
  {
    "author": "Boyan Tanchev",
    "text": "MARK ASS BROWNIE 🗣️🗣️🗣️"
  },
  {
    "author": "Swordkid",
    "text": "This is my first time watching a Marcusbrownlee phone review"
  },
  {
    "author": "Deflated Boobies",
    "text": "I&#39;m returning mine. the EID number ends in 766. the 66 is bad enough, but the 766 is too close to being 666.  OCD...sorry!"
  },
  {
    "author": "Sung Jin-Woo",
    "text": "Why would anyone copy this, when we already have alternatives like under display cameras that are getting better and better. Also the motorized ones like OnePlus 7 Pro"
  },
  {
    "author": "Samwich",
    "text": "this is my first ever iphone at 15 years old, i switched from a broken galaxy a21s <br><br>needless to say the screen, audio, camera, software IS AMAZING"
  },
  {
    "author": "Devyn",
    "text": "Having used it now it’s remind me of the iPhone 7. It’s a couple of quality of life improvements. Nothing earth shattering but a good update for people that are due for a carrrier upgrade"
  },
  {
    "author": "Saad Alghalib alsharif",
    "text": "after 7 years with iphone 7 i finally bought the iphone 14 pro max it is like jumping to Mars in a new space ship❤"
  },
  {
    "author": "Patrick Star",
    "text": "I got this phone today. The speakers on this phone is absolutely insane"
  },
  {
    "author": "EnzordTV",
    "text": "I saw Diablo Immortal there, well played."
  },
  {
    "author": "Raja Sekhar Rapaka",
    "text": "These devices are getting more and more expensive, how many of you want to put a &quot;price cap&quot; on iPhone ;-)"
  },
  {
    "author": "HealthyBodyify",
    "text": "Does it have studio quality audio recording?? I wish to know which mobile phone has the best audio recording capability. Not many videos on this."
  },
  {
    "author": "ALEK",
    "text": "чакай какво българин ли е създателят???"
  },
  {
    "author": "Elegant Nails",
    "text": "The camera takes better pictures than my eye site"
  },
  {
    "author": "Alambe727",
    "text": "I am not down with the dynamic notch. Apple supposed to head    got rid of that. I will keep my  iPhone  12 pro max    for now."
  },
  {
    "author": "Sean I",
    "text": "Also i realize if the notch bar is movable on the iPhone 14 pro models move it all the way up and you basically got the iPhone 11 12 and 13.haha. Apple is not fooling <a href=\"http://anybody.lol/\">anybody.lol</a>. There phones are exactly the same year after year on the exterior.haha. Why can&#39;t they have a 4k screen resolution to match the 4k video your allowed to shoot? I&#39;m pretty sure Samsung and google will best them to that as well. I hope I&#39;m wrong tho."
  },
  {
    "author": "JJ SENSEI",
    "text": "Must be nice......if only I had the money to buy one."
  },
  {
    "author": "Sergio",
    "text": "Finna be flexing on everyone"
  },
  {
    "author": "A random kid on the internet",
    "text": "<a href=\"https://www.youtube.com/watch?v=H4SXsmXZlwk&amp;t=02m33s\">02:33</a> wait isn&#39;t it 2000 nits?"
  },
  {
    "author": "Deana Michael",
    "text": "Nice bro"
  },
  {
    "author": "Smoj",
    "text": "Not the dramatic intro plssss"
  },
  {
    "author": "Dracula",
    "text": "I just bought mine.. can u make a game reviews if u will experience fps drop and lagging. Thx u I hope u can see my comment"
  },
  {
    "author": "Emperor BL",
    "text": "Stuttering in mobile legends maybe powermac iphone has issues not lagging in some games"
  },
  {
    "author": "Angielan Dagala",
    "text": "<a href=\"https://www.youtube.com/watch?v=H4SXsmXZlwk&amp;t=10m30s\">10:30</a> Soo cute Will!"
  },
  {
    "author": "Black White",
    "text": "I switched from Android to iPhone 14 Pro Max. After a month I am going back to the Galaxy Ultra. Seriously iPhone has sooooo many limitations.    <br><br>- No Multiview,   <br>- No APK, <br>- Far better 3rd party audio softwares like Poweramp, <br>-  And U need a separate software just to transfer  files to and from the device (ITunes etc)….with Android it’s just plug it in and move files. <br><br>The Galaxy Ultra is just a better phone in general"
  },
  {
    "author": "Septembersmine",
    "text": "What’s that car game you were playing bro ?"
  },
  {
    "author": "Carlos",
    "text": "upgraded from and iphone 12 mini and WOW i don&#39;t regret it one bit. The battery is excelent from when I start my day at 6am to when I get home at <a href=\"https://www.youtube.com/watch?v=H4SXsmXZlwk&amp;t=7m30s\">7:30</a> usually about 10-20% juice left. I&#39;m constantly on calls/browsing homes/emails/videos/photos. The screen is absolutely beautiful and the purple is a plus ;)"
  },
  {
    "author": "amani mdami",
    "text": "Me seeing no difference in photos quality from other phones🥺"
  },
  {
    "author": "loyal4 the way",
    "text": "apple is trash 🗑️"
  },
  {
    "author": "James Arthur",
    "text": "iPhone with no charger cable, I have to charge my phone using my MacBook air charger cable. iPhone died when Steve Job died."
  },
  {
    "author": "Jassar Aljardani",
    "text": "I like it"
  },
  {
    "author": "a a",
    "text": "dYNAmiC IslAnd lmfao get outta here with your dogsh!t tech babble crapple its AN UGLIER BIGGER NOTCH YOU LOSERS!!!!<br><br>HAHAHAHAHAHAHAHA!!!!"
  },
  {
    "author": "a a",
    "text": "geeee always on, auto focus, 120 htz, AND 400ish ppi....<br><br>nice of you to join the rest of us in the year 2017 crapple....<br><br>HOT.<br><br>GARBAGE."
  },
  {
    "author": "andrew roxas",
    "text": "Thank you GSM arena for this review, i watched this a million times before buying my first Iphone, which helped me decide. Now, watching this on my 2day old IP14PM. THANK YOU SO MUCH LORD FOR THIS BLESSING. This my first time to use Iphone since birth’ hehe and i really love it. I can understand now why Iphone user really loves their phone. Yeah its expensive but it worth your money, you can use it for 5-6 years because of the highest security and ultimate software support. I think i will never go back being an android user. 🙂"
  },
  {
    "author": "Ibrahim Omar",
    "text": "Dynamic Island Cutout is enormously big. Hope apple will make it a little bit smaller for next year&#39;s 15 pro series"
  },
  {
    "author": "Stonk",
    "text": "dreamy eyes"
  },
  {
    "author": "Karen Bautista",
    "text": "Can you help me  between silver or  deep purple which one? 😅"
  },
  {
    "author": "Jayrens Basilan",
    "text": "Mom pa hingi ng Cp na iphone"
  },
  {
    "author": "Malazarte, Naive Marie B.",
    "text": "Where can I buy your unboxed cellphone? miss mary"
  },
  {
    "author": "The Word Of God Spirit & Life Ministries- Cabuyao ",
    "text": "Thanks for sharing"
  },
  {
    "author": "Vanie Anne LZ",
    "text": "huge upgrade for me, coming from an iphone 11 regular.😊..so far, i love my iphone 14 pro max in gold😍"
  },
  {
    "author": "حبيس ذكريات الماضي  _ trapped in memories",
    "text": "❤💋"
  },
  {
    "author": "April",
    "text": "Thank you for this review M&#39; Mary!! I❤❤ I know 5 months na nakalipas na ito, pero worth it talaga siya. I just recently purchased the 14 pro max today because of your review. ❤❤🥰🥰"
  },
  {
    "author": "Melman",
    "text": "Switching from Samsung S8 Edge to iPhone 14 Pro. Check-out muna bago review. HAHAHA! It&#39;s been a long time since nakapag Apple ako. iPhone 4s pa huli ko. Please be good to me Apple!"
  },
  {
    "author": "Angelica Napagal",
    "text": "I made it to the last. Hehhehe❤❤❤"
  },
  {
    "author": "Frans Lumbayon",
    "text": "Got mine yesterday 😊"
  },
  {
    "author": "Florianne Valencia",
    "text": "Miss Mary normal ba sadya sa iphone 14 promax ang mag heat ang near camera sa back side mag heat lalo kapag ginagamit ang camera and video thank u"
  },
  {
    "author": "Mark David Ramos",
    "text": "Got my 14 pro deep purple. Thanks for this po. Penge po ako case. ❤️😉<br><br>Tinapos ko po yung video. Salamat po."
  },
  {
    "author": "Christian Arcega",
    "text": "nag eenjoy ako manood sayo ate marry, lagi di ako boring haha kahit sobrang haba pa ng video😅"
  },
  {
    "author": "Crizzy",
    "text": "I got mine iPhone 14pro max 😍"
  },
  {
    "author": "Lorenz Villanueva",
    "text": "Ano pong brand ng necklace nyo?"
  },
  {
    "author": "Mark Lopez",
    "text": "Got mine last march 24 2023 😊 from iPhone 11 to iphone 14 pro max 😁"
  },
  {
    "author": "JuliusBryle V",
    "text": "Got my iPhone 14 pro max last yesterday 🥰😍"
  },
  {
    "author": "Lanny • Verse",
    "text": "Got mine todaaay"
  },
  {
    "author": "Kimz42k Vlogs",
    "text": "👍👍"
  },
  {
    "author": "Elsha Mompero",
    "text": "Got mine last week, so far so good."
  },
  {
    "author": "Jhannis Zamora",
    "text": "How about The Loop po? Okay po ba mag buy sa The Loop? I’m about to buy iphone14 pro ❤"
  },
  {
    "author": "musicom pro",
    "text": "Watching from my ifone 14 pro max from poco x3 nfc😂 . Kung dpa nakapagkorea dko maafford to bigay lang dn naman kc to"
  },
  {
    "author": "Watch",
    "text": "mary, can you further explain kung ano ang pinagkaiba ng mga iphone na may series.. like iphone 14, 14pro and 14pro max taz meron pa yung may mga mga iphone plus, im wondering kasi king bakit may mga series parang iisa lang din naman.."
  },
  {
    "author": "Jake & Jhemz",
    "text": "At last ms mary my.first ios phone i phone 14 pro max just got yesterday march 08 2023🥺🥰grabeh sobrang ganda 🥰"
  },
  {
    "author": "Tapz out",
    "text": "got mine for only. 67k iphone promax 256gb"
  },
  {
    "author": "Ryuk",
    "text": "Here I am again. Watching things I can’t afford hahaha"
  },
  {
    "author": "Swede Swade",
    "text": "I am sticking muna sa aing Iphone 12 Pro Max"
  },
  {
    "author": "Avantika Adair",
    "text": "Do you also publish videos on what iphone to buy this year without only 1 line-up considered to in the choices?"
  },
  {
    "author": "Boyongph walk",
    "text": "Some of these days sana makabili hehe...drool😀👍"
  },
  {
    "author": "Aj Dean",
    "text": "I bought yesterday in verizon ,  im shocked very expensive but thres no adapter 🥴 only usb cable, u need to buy seperately to them if u want , 🥲"
  },
  {
    "author": "Incra Mant",
    "text": "Remove the notch, install android on it,  optional Gcam, Sdcard,  3.5 audio jack, FM Radio , root access with community support and you have the perfect phone. And make it on 3 nm maybe with a Snapdragon cpu.  Easy to change the battery and repair."
  },
  {
    "author": "Farrukh Saleem",
    "text": "Hi what wallpaper is it? Do you have any link or something thanks 😊"
  },
  {
    "author": "технології Електроніка",
    "text": "iPhone 8 plus You are there You will not use it as a camera📷🚫You will not use it as a device that you can use📱🚫You will never use it as a gaming device🎮🚫 don&#39;t buy this phone never😢 buy another phone like Samsung a54 or a34😘"
  },
  {
    "author": "Mithelesh Shah",
    "text": "whats the wallpaper, looks so good on the 14 pro max"
  },
  {
    "author": "RLT",
    "text": "Yeah!!! The workout phone! You don’t need heavy weights anymore!!! 😂😂😂😂😂😂😂😂"
  },
  {
    "author": "Tobias burinaga ensio jr Tobias burinaga ensio jr",
    "text": "Shot iphone n now 2023 iphone 15 models poisonous"
  },
  {
    "author": "David G",
    "text": "Please don&#39;t trust this guy. The information is wrong and misleading."
  },
  {
    "author": "Karen Tefo",
    "text": "where do u get the wallpaper"
  },
  {
    "author": "Schöfer Film",
    "text": "I uploaded today my first iPhone 14 pro max short test video (only handheld and without a filmic app) 😉 the cam is ok, but not similar in the quality and handling to my FX6 🎥 maybe I have to practice much more 👍🏻"
  },
  {
    "author": "4thelement011",
    "text": "Wall paper link please"
  },
  {
    "author": "Didiza Gal",
    "text": "Pls buy me one sir😢"
  },
  {
    "author": "detseroneLAG",
    "text": "Thank you so much for your honest review. I am considering changing providers and I am thinking about what phone to purchase when I do, and your review on this phone (which is one of the phones that I was considering) definitely helped me in making a decision on this phone. Now I am debating as to whether to go with the new Google Pixel 7 Pro or the new Samsung Galaxy S23 Ultra. Thank you. Cheers!"
  },
  {
    "author": "TONY HO",
    "text": "Would be nice if there’s a 7 inch iPhone"
  },
  {
    "author": "Lee Wainwright",
    "text": "Great battery life for a phone that costs over a bang of sand it&#39;s a no brainer"
  },
  {
    "author": "Simeon4o",
    "text": "bro what about bulgaria майка ти проста"
  },
  {
    "author": "JJ SENSEI",
    "text": "This phone must be nice.....if only I had the money to buy it."
  },
  {
    "author": "666 Dual Sport",
    "text": "Overpriced garbage, and the woke line up and pay like they lining up for their 678th covid shot"
  },
  {
    "author": "John Smith",
    "text": "Which watch are you wearing?"
  },
  {
    "author": "Odeejah Salmon",
    "text": "😂😂😂"
  },
  {
    "author": "2 Eazy.",
    "text": "Feel the burn love that I just a to sub"
  },
  {
    "author": "Tasha Marie",
    "text": "I love my pro max although I feel like when I type its lagging. And to swipe on the Home Screen I have to put some pressure  on it to get it to move."
  },
  {
    "author": "Dusty Roads",
    "text": "I purchased one two weeks ago after living with my iPhone 7 plus for years and my Impression is kind of blaaa.   I really don’t see much improvement over my 7 plus at least for normal everyday use."
  },
  {
    "author": "Clique53",
    "text": "Smoke on the waterrrrrrrrrr!"
  },
  {
    "author": "Yuwinx",
    "text": "I got a gold one"
  },
  {
    "author": "Kd Sethi",
    "text": "apple hasnt done anything special. Most androids are far ahead providing smaller notch and better display and customization. I have iphone 11 pro max and it feels the same as iphone 14 pro all over. switching to s23 galaxy now as i dont with buying the same phone just for better display and nothing else."
  },
  {
    "author": "SheffieldRock",
    "text": "Lovely cat...!"
  },
  {
    "author": "Antti Karhu",
    "text": "Steve Jobs wouldn&#39;t be happy with that phone."
  },
  {
    "author": "loyal4 the way",
    "text": "android all the way"
  },
  {
    "author": "Jesus Navarrete",
    "text": "The Videos going black and the playback keeps going. Drives me nuts. Airplay is a coin toss still."
  },
  {
    "author": "J.B. Ley",
    "text": "Quality review, complete with solid technical points, real- world use expectation vs. reality after use, and hilarious sarcasm, visual expressions, and edgy commentary. Clearly a great presenter with a ton of personal opinions that he was not hesitant to share. A  rock solid review with a decent level of entertainment value. loved it. this guy kills me. HAD to subscribe."
  },
  {
    "author": "Max Tech",
    "text": "SmallRig Mobile Video Cage Kit ➡ <a href=\"https://bit.ly/3Ib1nZ6\">https://bit.ly/3Ib1nZ6</a> (B&amp;H) &amp; <a href=\"http://bit.ly/3YiPGFq\">http://bit.ly/3YiPGFq</a> (ADR)<br>SmallRig Tabletop Mini Tripod ➡ <a href=\"http://bit.ly/3JTcnvt\">http://bit.ly/3JTcnvt</a> <br>SmallRig RGB Video Light ➡ <a href=\"https://bit.ly/3IcVgTU\">https://bit.ly/3IcVgTU</a>"
  },
  {
    "author": "altarwork",
    "text": "It’s cool you listen to music with Cory Asbury in it. He was a worship leader at the International house of prayer in Kansas City when I was there back in the day."
  },
  {
    "author": "majda breliof",
    "text": "I’m happy with my 12 pro max, nothing encouraging me to change it"
  },
  {
    "author": "Bobby Hudson",
    "text": "I will admit the main reason for my trading my 13 mini for the 14 pro max was the always on display and 2nd the display size and 3rd the battery life was horrible after iOS 16"
  },
  {
    "author": "Sevir",
    "text": "With inflation going strong, I wonder if it make sense waiting or just grab a 14 Pro / Pro Max now.<br>I&#39;m using an iPhone 11 right now and it is on its last leg."
  },
  {
    "author": "Ailurophile",
    "text": "Why haven&#39;t you been smiling at <a href=\"https://www.youtube.com/watch?v=CTkagcQCJAU&amp;t=8m05s\">8:05</a>?"
  },
  {
    "author": "USAFgirl1994",
    "text": "I hate my iPhone 14 pro max!! It doesn’t hold a charge and it actually will pause charging due to overheating but the worst part is it burned my so badly I had to contact Apple they’re taking care of me but I’d definitely pass on this phone and wait for the 15 series."
  },
  {
    "author": "Flavio Sousa",
    "text": "No"
  },
  {
    "author": "Jeremiah Norton",
    "text": "I just bought this phone. wish I would&#39;ve saw this video 1st. 😥"
  },
  {
    "author": "Speedbird 1",
    "text": "just bought it a few hours ago , not too sure if the size is for me ."
  },
  {
    "author": "TuvingtonD",
    "text": "The dynamic island is a buttery smooth v1 UX feature, no need to expect so much or be so disappointed in it."
  },
  {
    "author": "Elbert Lee",
    "text": "Battery life sucks compared to iPhone 13 Peo. And this is with the AO display turned off"
  },
  {
    "author": "Patryk",
    "text": "ah and i just bought ip14 pro 4days ago..."
  },
  {
    "author": "Iustitiae Pervenit",
    "text": "All these reviews are the same. No imagination at all. Like chatgpt wrote same script for all of you"
  },
  {
    "author": "Sean I",
    "text": "Also i realize if the notch bar is movable on the iPhone 14 pro models move it all the way up and you basically got the iPhone 11 12 and 13.haha. Apple is not fooling <a href=\"http://anybody.lol/\">anybody.lol</a>. There phones are exactly the same year after year on the exterior.haha. Why can&#39;t they have a 4k screen resolution to match the 4k video your allowed to shoot? I&#39;m pretty sure Samsung and google will best them to that as well. I hope I&#39;m wrong tho."
  },
  {
    "author": "Ricky Gee",
    "text": "Hey, some room sound treatment would help your studio space a lot! Or maybe a quick EQ on your audio would help!"
  },
  {
    "author": "Sam Calforn",
    "text": "I was planning to upgrade from my 12 to 14 pro but not anymore.<br>Just hoping they’ll give Dynamic Island and 120hz screen on the 15 series as well not just the pros"
  },
  {
    "author": "Zet Rix",
    "text": "You&#39;ve mentioned there are shortcuts to change the format of HighRes/ProRes videos/photos instantly to HEIF &amp; HEIC, <br>Would be great if you share the link of those..."
  },
  {
    "author": "Yue Fei",
    "text": "Upgrading from the iPhone 7 almost anything would be added value."
  },
  {
    "author": "Ghost",
    "text": "I love my 14 pro max ! No regrets"
  },
  {
    "author": "jim dean",
    "text": "How about a phone we’re the battery can last for two days on bashing use again. The phone is nice but then again there is the commercial stand by?? What’s up with that? Is that a feature? Can I turn it off?"
  },
  {
    "author": "Lynn",
    "text": "I&#39;ve listened with interest, I have never been so disappointed with any phone camera than I was with the 14 Pro Max! I had to use the Halide Pro App to get a decent photo, unless I wanted to use raw and edit all the time. I sold my 14 Pro Max for the Pixel 7 Pro, way better camera. If the iPhone 15 Pro Max camera is better this year, I&#39;d go back in an instant, as I like everything about the iPhone. 🤷🇬🇧"
  },
  {
    "author": "young martin",
    "text": "My apple battery pack is not charging my iPhone 14 pro max. Why? Help?"
  },
  {
    "author": "Courtney Nicole",
    "text": "Samsung stays killing iPhones lol iPhone sucks"
  },
  {
    "author": "Cameron Pavelic",
    "text": "Been using my IPhone X since release, but it finally died on me couple days ago. While I was waiting for the 15 later this year, my X couldn’t wait that long so I picked up the IPhone 14. Unless you’re super into videography and photography, I don’t see how waiting for the 15 will do you any favors, this IPhone feels like it’ll do me just fine for the next 5 years. X was the last time I planned on upgrading every year and I feel like I haven’t missed anything by skipping 4 generations prior."
  },
  {
    "author": "Peony Spencer",
    "text": "Does your iphone 14 gets warm when charging using 20W charger?"
  },
  {
    "author": "praveen felix",
    "text": "15 pro max would cost above 1500$"
  },
  {
    "author": "RockingChode",
    "text": "What’s the phone case you’re using ??"
  },
  {
    "author": "HUNCHO SAM",
    "text": "My Iphone 14 pro max will still dim. I have auto brightness off. Does anyone know a fix to this?"
  },
  {
    "author": "Patricio Ulloa",
    "text": "Fantastic … but the phone it’s made for calling or messaging..the titanium case on the 15 ultra or pro max it’s  propaganda the Apple Watch ultra scratch incredibly easy .. this change it’s made for the looks only."
  },
  {
    "author": "ThatguyV713",
    "text": "Just ordered the 14 pro max 1024 Gb can’t wait for the upgrade compared to my iPhone 12 max pro lol 😅"
  },
  {
    "author": "Scott James",
    "text": "Awesome review dude! I had the 13 pro max but upgraded to 14 pro. I wanted a smaller phone. I work hard labor and the max model just weigh you down. Also I hike a lot and always by myself. I am out of cell range and the satellite tech could be a lifesaver. Also another point is the brightness. When you are knee deep in snow and want to catch that iconic photo you can’t even see your screen due the outside sunshine and your phone not being bright enough. Not anymore. Island is awesome. If you don’t have a 14 pro get one! Don’t buy a regular 14 if you have a 12 pro or 13 pro you need the 14 pro or you will be 😢!"
  },
  {
    "author": "UnPack ",
    "text": "Good Video"
  },
  {
    "author": "E J",
    "text": "Damn it Apple bring back round home button"
  },
  {
    "author": "Warren Rupnarain",
    "text": "Thank you very much for your detailed reviews on the iPhone 14 models. The reviews are extremely informative. Keep up the great work!"
  },
  {
    "author": "Anna",
    "text": "Just set up my I phone 14 pro max in black . Love it love the feel of the phone gorgeous fast phone . I like the dynamic island something different. Cant wait to use the new camera . Feels a little heavier . Im coming from the. I phone 12 pro max . The I phone 12 pro max felt very slippery in my hand without a case most of the time I had a case obviously on my phone. And tomorrow I am trading in my I phone 12 pro max for a trade in value for like 580 cdn . Plus I got a good very good deal from my phone carrier . 0 dollars down . 🎉"
  },
  {
    "author": "Mark Slima",
    "text": "just got the iPhone 14 pro max - an upgrade from a standard iPhone 12... i was not expecting as big an improvement as this has been. hugely improved, particularly the audio experience was a bit of a pleasant surprise for me.  the iPhone 14 sounds fantastic on its speakers, i won&#39;t have to compulsively use my AirPod Pros so much now"
  },
  {
    "author": "GtrMusic",
    "text": "CNET and two &quot;borrowed&quot; iPhones was enough to know this would be an a** kissing fest from first to last minute."
  },
  {
    "author": "Mickey’s Rando YT",
    "text": "All this video did was make me miss living in the bay area"
  },
  {
    "author": "Paul Gerard",
    "text": "Solid review 👍🏼"
  },
  {
    "author": "so★",
    "text": "Is there really a tranny flag wallpaper"
  },
  {
    "author": "4vuln",
    "text": "goofy thumbnail"
  },
  {
    "author": "MW2 CHEATS ON MY CHANNEL BANNER ABOUT PAGE",
    "text": "Robux on my account.. thank me later"
  },
  {
    "author": "Raven Flame",
    "text": "Great video. Covered all the questions I had 😊"
  },
  {
    "author": "Z33 HD",
    "text": "<a href=\"https://www.youtube.com/watch?v=gOErA-ttbdA&amp;t=2m57s\">2:57</a>, i thought i had the minecraft menu running in the background lol"
  },
  {
    "author": "Delois Jackson",
    "text": "I have the iPhone SE 3rd generation &amp; i love it and its cheaper and my camera works great, but since the iPhone 14 been out, apple has already sent out 2 software updates, because some customers have been having problems with their camera. That’s too much money for a phone for some people to be having problems already. I’m staying with my iPhone SE."
  },
  {
    "author": "Den C",
    "text": "Upgraded from Iphone XS 64GB to iPhone 14 pro Max 1TB. Huge upgrade. The signal is kind of weak even if it’s in 5G."
  },
  {
    "author": "Jared Bowers",
    "text": "me looking at my iPhone 6s..."
  },
  {
    "author": "LEON HOUSE Apps, Games, Music & etc.",
    "text": "This was a terrible review. Almost like Apple paid him to make it. So positive throughout with hardly anything negative. Blah."
  },
  {
    "author": "Mikey Lejan",
    "text": "I just bought the 14 pro max today! It is a huge upgrade from my xs max! The xs max was bought as a 2nd hand device."
  },
  {
    "author": "Tim Miller",
    "text": "My wife and I r doing once in life time trip to Israel. We both have XS I phone. Is the price and picture difference worth the value. Thanks for your time. Tim"
  },
  {
    "author": "Rainy Sunday",
    "text": "Prefer my iPhone xr"
  },
  {
    "author": "Jay1997",
    "text": "Gonna get the pro max this winter I have the XR time to upgrade"
  },
  {
    "author": "espedale",
    "text": "Went from iPhone 11 Pro Max to iPhone 14 Pro Max and I  was not impressed. Seems very gimmicky for  the money. I took a low light photo with both and the 11 was MUCH better. In normal light they look almost identical due to the pixel binning by the 14. The battery life was not much better than the 11, presumably due to the &quot;always ON&quot; feature. I could care less about the automobile crash notification or the dynamic island. Returned my phone and will wait for the iPhone 15.  Maybe the 15 will FINALLY support USB-C?"
  },
  {
    "author": "Zion",
    "text": "The dynamic island is not enough of a motivating factor for people who have the iPhone 13 to upgrade to the 14 pro max. Maybe the iPhone 15 will have more features that are worth upgrading for."
  },
  {
    "author": "Connie Lahman",
    "text": "So you said favorite phone is 14pro and wondering if any issues with battery life since owning it with normal use. Did you feel the pro max was a little big and heavy?"
  },
  {
    "author": "frank re",
    "text": "Great review love the 14 pro very smooth great camera!"
  },
  {
    "author": "johnyBaby",
    "text": "The worst phone I have ever bought. 😫 switched from Samsung after using it for 6 years. My God apple is extremely inconvenient to use. Returned the next day. NEVER IN MY LIFE WOULD EVER USE APPLE PRODUCTS AGAIN. THEY HAVE LOT OF WORK TO DO WHEN IT COMES TO SOFTWARE."
  },
  {
    "author": "John m",
    "text": "Liked and subscribed ,l am going from the iphone 2020 se to the 14 pro max , awaiting delivery :)"
  },
  {
    "author": "CHUCKSEESE",
    "text": "I was with apple for ten years. I recently switched to to a fold 4 because iphones are behind in technology"
  },
  {
    "author": "The Tech Chap",
    "text": "Hey Chaps! Have you bought an iPhone 14??"
  },
  {
    "author": "Molly D",
    "text": "Upgraded my phone from ip7 to iph14 pro max and it’s huge upgrade. I really do the new phone."
  },
  {
    "author": "Courtney Wedderburn",
    "text": "<a href=\"https://www.youtube.com/watch?v=iNYEzYKrcqI&amp;t=8m16s\">8:16</a> that has to be Sandford Gloucestershire... that picture gave me Hot Fuzz vibes."
  },
  {
    "author": "Lucky Guntausky",
    "text": "that 7k+ emails tho haha"
  },
  {
    "author": "Master Oogway",
    "text": "Not everyone upgrades from 13 to 14. I don’t know why people think that this is a proper comparison."
  },
  {
    "author": "Nature",
    "text": "Greet from Malaysia🇲🇾"
  },
  {
    "author": "Tom Hoppel",
    "text": "you can swipe down from the bottom to have the screen come down to access apps or features that are higher up"
  },
  {
    "author": "Touching Grass",
    "text": "Just got this to replace the iPhone&#39;s 4 &amp; 7 (go ahead, roast me) that I currently use. Shit&#39;s about to get real."
  },
  {
    "author": "M M",
    "text": "I’m going to keep my 12 pro max.  Just don’t see enough for an upgrade"
  },
  {
    "author": "Nick Coates",
    "text": "I’d really like the looks to change iPhone has looked the same for so long. I’d like to see a folding iPhone or something in the future it would be cool"
  },
  {
    "author": "MoonGaming",
    "text": "I’m currently using IPhone 11 Pro Max do you think the upgrade is worth it?"
  },
  {
    "author": "Wilson Negrini",
    "text": "Hehehe... try buying a 1T in Brazil, it&#39;s around 3k dollars!"
  },
  {
    "author": "Nathan Davis",
    "text": "The ultras 22 smokes the iPhone camera !"
  },
  {
    "author": "Brian in_NYC",
    "text": "13 looks a lot better lol"
  },
  {
    "author": "Eric Vellekoop",
    "text": "@<a href=\"https://www.youtube.com/watch?v=iNYEzYKrcqI&amp;t=2m10s\">2:10</a><br>Optical means lense. That 2x zoom is just digital. You don&#39;t &#39;lose quality&#39;, because of the megapixel increase. <br><br>There are three optical lenses: ultra wide, main lense and the 3x zoom lense. There is no 2x optical zoom."
  },
  {
    "author": "Callamastia",
    "text": "hehehe... <i>&quot;two handed job&quot;</i>"
  },
  {
    "author": "SA-Elite",
    "text": "Iphone 14 pro max has been nothing but a let down so far. The phone is not capable of handling hardcore gaming, it heats badly around the cameras when doing basic tasks. My iphone 12 pro max is still giving it a run for it&#39;s money. Mind you, I complained about the heating issues to Istore and they refused to replace it, instead they sent it to the service centre to be checked and fixed. Wouldn&#39;t recommend it to anyone to be honest."
  },
  {
    "author": "Jahi Sadiq-el",
    "text": "This is by far the best review of a phone I have ever seen. Bravo sir."
  },
  {
    "author": "Liutenant Lama",
    "text": "As someone who recently just upgraded from the 12 pro max to the 14 pro max i can say the improvement is much much more noticeable. Although for those who are upgrading from the 13 probably wont notice too much i think."
  },
  {
    "author": "Elliott Wallace",
    "text": "Honestly don&#39;t get peoples issues with the dynamic island? It finally removes the notch which was Android users biggest thing about apples screens and not only have they changed it but they&#39;ve made it software for ease of life use. I honestly do not get the problem with it 😂 been samsung all my life but had some recent bad experiences with them so am probably going to change to apple in my next phone contract as I love the dynamic island idea"
  },
  {
    "author": "Tantalic Sage",
    "text": "I’m upgrading from iPhone 11 Pro Max so is it worth the price?"
  },
  {
    "author": "rafikz77",
    "text": "30 fps is actually cinematic lol"
  },
  {
    "author": "♡𝚂𝚊𝚕𝚟𝚊𝚝𝚘𝚛𝚎♡",
    "text": "<a href=\"https://www.youtube.com/watch?v=iNYEzYKrcqI&amp;t=10m27s\">10:27</a> i took my phone here and took pictures of the castle! I thought i knew where it was lol (i have the 14 pro max)"
  },
  {
    "author": "Atlant",
    "text": "I dont like the middle why not make like galaxy a small dot"
  },
  {
    "author": "Narada",
    "text": "Anybody pat the price for these new phones be it Samsung or Apple need to go seek therapy because their brains don&#39;t work properly"
  },
  {
    "author": "Brian Pope",
    "text": "If you think the 14 pro max needs to be warmer maybe you need a tan buddy"
  },
  {
    "author": "swiftdetecting",
    "text": "would u go for the pro or max  ?  be using it everyday and main and also for photo and video as well as phone"
  },
  {
    "author": "MiMiSA chan XXV",
    "text": "I upgraded from ip11 to ip14 pro. Worth it"
  },
  {
    "author": "Liquid",
    "text": "I really don’t care for the cameras, so I wish they would do one without a focus on the cameras"
  },
  {
    "author": "Owino Macrotta Gilbert",
    "text": "This was very helpful💚"
  },
  {
    "author": "luvo Mgedezi",
    "text": "Did you say ‘Suppose my wife as well’ 😅"
  },
  {
    "author": "sue h",
    "text": "Beautiful cat!"
  },
  {
    "author": "Cristiano Caravaggio",
    "text": "Dreamy"
  },
  {
    "author": "Clay Inosaint",
    "text": "Still love the iphone"
  },
  {
    "author": "Paulo Correia",
    "text": "IOS is boring.<br>Samsung s23 is better."
  },
  {
    "author": "hannah Gibbons",
    "text": "I still have the 13 pro max and it’s a brilliant phone. The 14 is just a minor upgrade and not worth the hefty price hike!"
  },
  {
    "author": "Peat381 Low",
    "text": "I sorely miss the 5.8 inch original size for these phones. The iPhone X was the perfect size. It&#39;s designed to fit in the pocket. Not a tablet."
  },
  {
    "author": "DayOneDave ps4",
    "text": "I&#39;ve been android for so many years and today I&#39;ve just ordered an iPhone 14 pro max. 🤞🤞"
  },
  {
    "author": "Rose 🌹 Media   created by Paul Rose ",
    "text": "haha well held down in a gust of wind haha"
  },
  {
    "author": "Justin Price",
    "text": "If you’re on the go often and unable to get to an outlet, the larger Max may make sense, but for most I think the added size and weight isn’t practical"
  },
  {
    "author": "Justin Price",
    "text": "Please explain the heartburn about using the lightning port for file transfers.  Why not just use AirDrop? 🤷‍♂️ Frankly, I’ve never understood all the fuss about lightning.  I use MagSafe primarily for charging both at home and car 🙃"
  },
  {
    "author": "TECHNO KING",
    "text": "Switched to Iphone 13 last year from samsung....Iphone &gt;&gt;&gt;&gt;😘"
  },
  {
    "author": "Istiyak Priom",
    "text": "<a href=\"https://www.youtube.com/watch?v=0QQN3RtoVos&amp;t=5m03s\">5:03</a> which game?"
  },
  {
    "author": "JaguarGold",
    "text": "It’s boring in the same way that Windows is boring. But am I ever going to abandon Windows? No. Apple and Microsoft are standards now."
  },
  {
    "author": "Flat-Out Juan",
    "text": "I hate Apple"
  },
  {
    "author": "Nikolay Nikolov",
    "text": "Almost a week ago I switched from the regular iphone 13 to s23 ultra and even though the screen is massive the 120hz display and everything the new s23 ultra offer I still miss my iPhone experience after so many years. But still looking forward to the 15 pro and pro max even the 15 plus to see what&#39;s new because we all know &quot;apple in my heart feelling&quot;."
  },
  {
    "author": "Braska Bani",
    "text": "Man! 4k60 video is so good on iphone."
  },
  {
    "author": "Mellon Johns",
    "text": "iPhone 14 pro max is a great phone coming from a note 20 ultra <br>Was  definitely a great choice to switch"
  },
  {
    "author": "Tech Therapy",
    "text": "I switched from Samsung note 9 to iPhone 14 pro max 1tb and I haven’t regretted it so far"
  },
  {
    "author": "Paul",
    "text": "Apple is still the best EDC phone for most people. They got the biggest things the most right, convenience and consistency."
  },
  {
    "author": "Johnson Rojo",
    "text": "I see the cat = like straight away"
  },
  {
    "author": "KD",
    "text": "I&#39;m personally waiting for the Pixel 8 Pro &amp; iPhone 15 Pro. To see what my next upgrade will be from my OnePlus 8T."
  },
  {
    "author": "cubeboy",
    "text": "Using the 14 pro purple😅"
  },
  {
    "author": "jimi sean",
    "text": "At what percentage do you normally recharge"
  },
  {
    "author": "B N",
    "text": "I relied on the money that I pay for the features that I get, regardless of the company. A month ago, I bought a used Ultra 22 at a price of $550, so I think there is no iPhone or any phone better than it at this price."
  },
  {
    "author": "Shubam Tandel",
    "text": "Totally agree, using the 14 pro max and its nothing new, same old same old"
  },
  {
    "author": "MrLeorio",
    "text": "You are just a Fan. Admit it"
  },
  {
    "author": "Tom Kostolom",
    "text": "Got a 14 pro max myself about 10 days ago, switched from S22 and I am very satisfied. No laggy animations and battery is way better."
  },
  {
    "author": "James Aseto",
    "text": "<a href=\"https://www.youtube.com/watch?v=0QQN3RtoVos&amp;t=4m21s\">4:21</a> oyoyo my anxiety spiked!"
  },
  {
    "author": "Mehrob Murodalizoda",
    "text": "<a href=\"https://www.youtube.com/watch?v=0QQN3RtoVos&amp;t=7m10s\">7:10</a> what&#39;s the game?"
  },
  {
    "author": "MeInMoment",
    "text": "Well I’m just commenting to get the free iPhone 14 pro max😂"
  },
  {
    "author": "Aries",
    "text": "I just got the 13 pro and feel regret of the front camera. Should’ve buy the 14 pro instead because the autofocus really makes a different result, especially if you took a close up photo/video. It gives so much in detail. Wish i can change my 13 pro to the 14 pro 🥹"
  },
  {
    "author": "Susan Meredith",
    "text": "Thanks for your video.  Today I upgraded to the 14 pro. This video validated my decision to upgrade from the XS Max.  After having a 7 Max &amp; XSmax, I did decide to go with the pro, and not get the Max. Hope I don’t regret not getting the Max. Selfies too difficult with Max size, and heavier."
  },
  {
    "author": "Ayu Abdullah",
    "text": "The 14 pro max on mine the screen brightness keeps adjusted by its own to brighter my liking even after I chsnge to manual.<br><br>I took photo using the phone camera &amp; screen shots but when I try to send via wasap to my hubby the files showing empty. But when I open gallery the photos are still there. <br><br>I’m puzzled. Just switched from android to iphone."
  },
  {
    "author": "Mel Phillips",
    "text": "Love my iPhone 14 pro max! Thought I’d hate the larger size but in fact it’s just right!"
  },
  {
    "author": "Christo Dunkovf",
    "text": "Why wouldn’t Apple let the Pencil work on the pro max? I’m updating from an XS max to the 14 pro max."
  },
  {
    "author": "Juan Talk PH🇵🇭",
    "text": "I&#39;ven using UGREEN products for 3 years"
  },
  {
    "author": "Be A-Mayes'd",
    "text": "I currently have the 2nd Gen iPhone and I would love to take advantage of the new camera and island <a href=\"http://www.youtube.com/results?search_query=%23gregsgadgetsgiveaway\">#gregsgadgetsgiveaway</a>"
  },
  {
    "author": "Lonnie Garland",
    "text": "I have a broken phone <a href=\"http://www.youtube.com/results?search_query=%23greggadgetsgiveaway\">#GregGadgetsGiveaway</a>."
  },
  {
    "author": "Iliana Hadjieva",
    "text": "I want one to make videos"
  },
  {
    "author": "Patricia Hampton",
    "text": "I want the phone because of the camera."
  },
  {
    "author": "Tyrone Perry",
    "text": "I can&#39;t afford it really want one wish I could get blessed with one"
  },
  {
    "author": "Tamil Gaming Queen",
    "text": "Because we will watch the video only we can&#39;t be able to buy iPhone 😊"
  },
  {
    "author": "lungelo monaco sa",
    "text": "An iPhone 14PRO would be a huge upgrade since I still have the iPhone 7,i love the technology in the phone and all the features especially the dynamic island…I’d love to experience everything you talked about here…<a href=\"http://www.youtube.com/results?search_query=%23gregsgadgetsgiveaways\">#GregsGadgetsGiveaways</a>."
  },
  {
    "author": "Patricio Ulloa",
    "text": "Not what I thought...do i regret..disappointed..not what i expect..a total failure ..but still buying and doing PROPAGANDA to mantain a channel for a extremely overpriced devices that no one  really need . sorry but its true"
  },
  {
    "author": "Alonzolopezoffical",
    "text": "I just got a iPhone 11 Pro Max in 2026 I might get the new iPhone pro max at the time"
  },
  {
    "author": "MamaLeng Vlogs",
    "text": "Didnt experience using an iphone 😭😭😭😭😓"
  },
  {
    "author": "Delmations",
    "text": "Hey greg, been a fan for a while now <br>Would really appreciate winning a new phone since my iPhone 7 i was using broke back in December and the iPhone XS I’m using now has a degraded battery, screen burn in, and is SIM locked to an American carrier so I’m unable to use my SIM card <br>It would be a great help for a broke college student <br><a href=\"http://www.youtube.com/results?search_query=%23gregsgadgetgiveaway\">#GregsGadgetGiveaway</a>"
  },
  {
    "author": "Amoy Boucher",
    "text": "Thanks for this review, I was debating what phone to get. I would definitely want a Pro Max to help me with my business venture."
  },
  {
    "author": "DJREDZ784",
    "text": "I really need a new phone for my dj gigs and I’m still using the iPhone 6s <a href=\"http://www.youtube.com/results?search_query=%23gregsgadgetsgiveaway\">#gregsgadgetsgiveaway</a>"
  },
  {
    "author": "TC DA",
    "text": "Have one Great new phone 14 Pro Max  lots of Learning still  ongoing."
  },
  {
    "author": "Emelike Emeka Emmanuel",
    "text": "You&#39;re aren&#39;t objectively criticizing the dynamic island and always on display. This is more like a fanboy praising apple for making inefficient features. The brightness of the always-on display on the battery capacity..."
  },
  {
    "author": "John Turner",
    "text": "I need one not that want one I need it"
  },
  {
    "author": "Vladimir Olshanskiy",
    "text": "How many features the Apple add it to 14 pro and promax it’s really worth it to have that phone. It’s out of that world. If I have a chance, I wish to have it one of them."
  },
  {
    "author": "ADC ACD AACD AAA",
    "text": "it is the worst."
  },
  {
    "author": "Mike Peebles",
    "text": "Awesome Podcast choice!!! ATP"
  },
  {
    "author": "Gigi Sawyer",
    "text": "I&#39;m 63 years old and not at all techy, and you&#39;ve been very helpful.  My 10 has finally died and I&#39;m desperate for a new phone.  The photo quality and videoing is very important to me, and you&#39;ve answered a lot of questions for me.  Thank you very much."
  },
  {
    "author": "Frank Caferra",
    "text": "I would like to win it because I’m old"
  },
  {
    "author": "Steevee Official",
    "text": "This will be my First IPHONE &lt;3 need this badly"
  },
  {
    "author": "Jose Eliseo Gutierrez",
    "text": "SOUNDS LIKE HE IS GOING TO GIVE ME THE IPHONE BUT THEN HE IS SELLING ME SOMETHING 😏"
  }
]