[
  {
    "author": "Samsung",
    "text": "Play on 🎮 with a super powerful processor and snap away 📷 in ultra-high resolution. What epic moments will you share?<br>Learn more: <a href=\"http://smsng.co/S23Ultra_Intro_ytp\">http://smsng.co/S23Ultra_Intro_ytp</a>"
  },
  {
    "author": "Lilly Zs",
    "text": "23 million views 😂😂"
  },
  {
    "author": "Z15TEEN",
    "text": "Samsung cameras hardware is far superior to apple iPhones’ one."
  },
  {
    "author": "Mohammad Fallah",
    "text": "Will the Victus touch screen get scratched by finger touch in the long term?"
  },
  {
    "author": "Ian WC Jacobs",
    "text": "Ok i am jealous"
  },
  {
    "author": "🎃REDCLIFF CITY🎃",
    "text": "An Apple user Will regrets buying iphone"
  },
  {
    "author": "Amrullah Sied",
    "text": "Nice"
  },
  {
    "author": "Nkuba Harry Mumba",
    "text": "OKay Samsung Racist much? Why you gotta include the black guy last?"
  },
  {
    "author": "Andor Sagi",
    "text": "I really love my S23 Ultra, but I am not a fan of this commercial lol"
  },
  {
    "author": "Quinny",
    "text": "I just got it a few weeks ago and have been in love with it since. ❤"
  },
  {
    "author": "_Multi-FaceZ_",
    "text": "83k likes??"
  },
  {
    "author": "Christophe",
    "text": "Samsung, you guys gotta get rid of the curve..it&#39;s obsolete and temper glass won&#39;t stay in tact because of it.."
  },
  {
    "author": "amari stevens",
    "text": "I&#39;m am glad that I now own the galaxy S23 ultra"
  },
  {
    "author": "Keith",
    "text": "My s23 ultra Internet coverage is unstable inside building. While my Note 20 works fine. Both using same carrier  service"
  },
  {
    "author": "Ravi Prakash",
    "text": "I bought it and i love it!"
  },
  {
    "author": "PRAKASH KHANAL",
    "text": "But i phone is dream for everyone 😅"
  },
  {
    "author": "JayProGroup",
    "text": "So awesome 👏🏽 I’m an apple loyalist but il love to have this phone"
  },
  {
    "author": "Space Sweat",
    "text": "Me watching this with a s23 ultra"
  },
  {
    "author": "ربيع صلاح",
    "text": "But the problem is for $1,099 😭😭😭"
  },
  {
    "author": "neko7abc $",
    "text": "Me falta es plata xd"
  },
  {
    "author": "Ashley",
    "text": "Just gonna get the s23 ultra when I save up"
  },
  {
    "author": "Mitch Norris",
    "text": "I love my S23 Ultra, I can&#39;t get over the things this phone can do, and the camera well thats self explanatory. Awesome phone!!!"
  },
  {
    "author": "Jose",
    "text": "Yes Sir!!! all I keep hearing is good things about this phone The new S23 ultra. I just purchased mine today 🎉 (256 gb phantom black )can&#39;t go wrong of course. The great thing is i only Paid $559!! for a brand new S23 ultra of course with a trade in my old (Samsung S22 ultra) awesome deal!!!"
  },
  {
    "author": "FRANCIS OKAKA",
    "text": "The lion is here. ..I have to own one"
  },
  {
    "author": "Achyut Mishra",
    "text": "Song name in the last ?"
  },
  {
    "author": "Svny Mobi",
    "text": "Hi im use s23 ultra and the chrome bezel wasnt build realy well the paint was so bad and can&#39;t claim s+ waranty because its not phone software eror lol what a joke"
  },
  {
    "author": "Muhammadayub Mashrabov",
    "text": "awesome video."
  },
  {
    "author": "Rahul Sharma",
    "text": "S23 Ultra is awesome man ♥️"
  },
  {
    "author": "Astro Little Genie",
    "text": "<a href=\"https://www.youtube.com/watch?v=BSYsXVFzmKA&amp;t=0m23s\">0:23</a> Motor <a href=\"https://www.youtube.com/watch?v=BSYsXVFzmKA&amp;t=0m49s\">0:49</a> Deep Sea [Subtitle] <a href=\"https://www.youtube.com/watch?v=BSYsXVFzmKA&amp;t=1m08s\">1:08</a> DéSpace UFO And Dévano S Funtasic Sofa <a href=\"https://www.youtube.com/watch?v=BSYsXVFzmKA&amp;t=2m03s\">2:03</a> Night"
  },
  {
    "author": "Nasem Lebanon",
    "text": "Nice and more expensive than the iPhone 14😂"
  },
  {
    "author": "Daniel",
    "text": "Wow. I haven&#39;t seen a flick of your dog in a min. Life. Your videos have been breaking down things I don&#39;t understand, so I can process tech, since before you went to college. Thank you. S10 to S23 is going to be fun. Stay up fam ✌🏾"
  },
  {
    "author": "Daniel",
    "text": "The OVO Barc jersey. Noiceeee"
  },
  {
    "author": "Rafik G. Rizkallah",
    "text": "i am still using NOTE 9 , almost 7 or 8 years now honestly and i swear it still amazing and the battery lasts 2 days with normal usage , one thing happened its not water proof anymore... I LOVE IT but will get the s 23 :)<br>ONE  thing i dont like that samsung started to do now.. NO SD card - sounds like i phone now !"
  },
  {
    "author": "Rafik G. Rizkallah",
    "text": "in the minute<a href=\"https://www.youtube.com/watch?v=zhoTX0RRXPQ&amp;t=4m03s\">4:03</a>  i figured out that the pen&#39;s sceratched or its the old one !"
  },
  {
    "author": "Mohanjith Marla",
    "text": "If someone who doesn&#39;t have a Samsung phone right now, and is looking to buy either S22 Ultra or S23 Ultra, which would you recommend ? @mkbhd"
  },
  {
    "author": "Den K",
    "text": "Picture quality is still bad the only thing making me regret getting it unless you are in bright light picture looks bad time to switch to iphone 😩"
  },
  {
    "author": "Luca Mirshahi",
    "text": "Gonna get a s23ultra from the s21+, seems like it&#39;s gonna be worth it"
  },
  {
    "author": "Bamaboy Burns",
    "text": "Just got mine yesterday morning so far I&#39;m impressed I like the approvements they made its just so much you can do Sammy is the king"
  },
  {
    "author": "Gary Stone",
    "text": "faster charging kills the battery life and the battery will die quicker in the long run"
  },
  {
    "author": "Teresa Trimm",
    "text": "Wow. If you don&#39;t make and sell stock photos and videos, you are missing an income stream! Your &#39;B&#39; shots rock!!!"
  },
  {
    "author": "Nitesh Apte",
    "text": "Anyone noticed off-axis colour shifting on the screen of s23 Ultra?"
  },
  {
    "author": "Mark T.",
    "text": "Awesome review. Thank you!"
  },
  {
    "author": "stuff I see",
    "text": "Moon photo is fake"
  },
  {
    "author": "sachin s m",
    "text": "i bought this even though m a brokey.."
  },
  {
    "author": "10p6",
    "text": "No it&#39;s not. So far it&#39;s an expensive POS that is full of Samsung apps and ads, and has been cost cut with much less RAM, lack of PSU for more $$$."
  },
  {
    "author": "Willie Bradley",
    "text": "Can you do a video on PWM. I hear this phone is the worst foe what&#39;s actually important... your health!"
  },
  {
    "author": "Smallnuts",
    "text": "Sucks I can&#39;t do 200mp or 50mp burst shots."
  },
  {
    "author": "Mariontl",
    "text": "Thanks for the good review. I just ordered the S23 Ultra from Samsung website. Have been using an S10 plus. Can&#39;t wait to get my new phone."
  },
  {
    "author": "Tony V.",
    "text": "You do a great job with the description of you videos.<br>Well done!"
  },
  {
    "author": "Abdullah Zimsam",
    "text": "When apple does same design for 5 years everytime, nobody complains. But when it&#39;s about Samsung"
  },
  {
    "author": "Daniel Zelpher",
    "text": "I just ordered one from Verizon. Trading in my Note 20 5g. I am excited to try out the camera."
  },
  {
    "author": "Angelo Arriola",
    "text": "Please can you do an investigative review on how ‘software updates’ cripple the camera. I have an Note 20 Ultra and when I first purchased it, the camera was AWESOME. Now in 2023 after software updates, the photo quality looks, well, just a little better than VGA quality. I reckon software updates cripple the cameras to encourage people to upgrade and buy new phones."
  },
  {
    "author": "Johnny Blaizee",
    "text": "Should I upgrade my flip 4 to the ultra ??"
  },
  {
    "author": "Kingbae",
    "text": "My own battery is going down quick 😢"
  },
  {
    "author": "Beverly Crittendon",
    "text": "I just love his reviews"
  },
  {
    "author": "GadgetsTok",
    "text": "Zoom capability of Samsung Galaxy S21 Ultra is far superior than both S22 Ultra and S23 Ultra....Also S23 Ultra Primary New Camera Sensor is worst working than previous HP3 Sensor in S21Ultra and S23 Ultra 😢"
  },
  {
    "author": "ennergy's potato",
    "text": "I&#39;ve given up on phones"
  },
  {
    "author": "Hammad Moosa",
    "text": "I switched from Xiaomi to Apple major problem is most of the features in camera and multi tasking app lock missing and in my country I can not use Apple services no direction in maps music app not working can’t download music and play them in Apple Music have to pay for everything switching to Samsung now getting more things In lower price"
  },
  {
    "author": "Emeck Lee",
    "text": "I wish android would change the UI."
  },
  {
    "author": "Indi R",
    "text": "Beleive Samsung made a mistake not going for a one inch sensor for the camera.  Even though might not have used the whole sensor beleive would have given better night photos especially with the software Samsung uses for the camera.  The body of the phone might have been thicker but people would not have minded."
  },
  {
    "author": "Nick Ackerman",
    "text": "iPhone 12 Pro Max vs Galaxy S23 Ultra Speed Test! Let&#39;s find out how Apple&#39;s 2020 Flagship stacks up to Samsung&#39;s 2023 Beast! Share your thoughts, questions, and comments, and enjoy the speed test!"
  },
  {
    "author": "Iftakhar Tamim",
    "text": "You’re miss judging ! Clock and Calculator was definitely first loaded on iPhone amd also some others applications too"
  },
  {
    "author": "Rusman Sunari",
    "text": "so we choose which one is this"
  },
  {
    "author": "An d",
    "text": "Samsung needs to fix whites on their displays. Samsungs white is not clean white. Apple white is clean white. I have old samsung s8 it has way clean white than this s23 ultra."
  },
  {
    "author": "Chee hwee Ong",
    "text": "I think,i phone is outdated"
  },
  {
    "author": "terry lafauci",
    "text": "Anybody notice how the battery on the iPhone stayed at 100% for over half the video? The Samsung dropped to 99% about a minute after it was turned on😂smh"
  },
  {
    "author": "Rhea",
    "text": "Awesome speed test.<br>Nice video as well👍😊"
  },
  {
    "author": "the equalizer",
    "text": "Thank you for this great work. I appreciate this, but I have a question. Is this Samsung in the experiment with an Exonus processor?  Im Snape Dragon"
  },
  {
    "author": "David Jackson",
    "text": "I have my S-22 Ultra and it&#39;s still a monster. I also have my two 13 pro-max(s) 1-TB&#39;s and 14 pro-max 1-TB. Still brand new (un-used)📱"
  },
  {
    "author": "Patrick Chong",
    "text": "S23 Ultra ❤❤"
  },
  {
    "author": "A Is",
    "text": "It’s incredible, the power of the Apple chipsets and their longevity"
  },
  {
    "author": "Ezraxmonster",
    "text": "Amazon would stop my music on the 13 max"
  },
  {
    "author": "Ezraxmonster",
    "text": "My very first flagship was the stand 12 and I had the 13 max and now  back on Samsung s23+"
  },
  {
    "author": "Cheyenne Gibson",
    "text": "I upgraded from the 12 Pro Max to the 13 Pro Max and then got bored with Apple and then went to the s23 Ultra... I love my Ultra.... very quick and snappy.... the camera absolutely amazing... I love the display and size of it.... took me a bit to get used to android after a few years of using IOS.. but overall iv had it for 2 months and it still feels like I just got it ♥"
  },
  {
    "author": "Olivur_",
    "text": "I&#39;d buy the S23 Ultra just for the Display alone."
  },
  {
    "author": "cliff Amos",
    "text": "Love your content Nick ❤"
  },
  {
    "author": "Daniel Uchiha",
    "text": "<b><a href=\"https://www.youtube.com/watch?v=3Dx9abYrcOs&amp;t=4m31s\">4:31</a></b><b>  yeah I&#39;m that hater he was talking about in the comments, we know each other very well</b> 😂"
  },
  {
    "author": "Enrique James D. Martin",
    "text": "generally the same .. no lags no hangs at all"
  },
  {
    "author": "adeleke simeon",
    "text": "Which video App do you use in rendering the video?"
  },
  {
    "author": "Lormor4",
    "text": "They are both beautiful phones. But most of my family have IPhones so it is easier just to keep the IPhone plus I really like it 😊 I enjoyed this comparison!"
  },
  {
    "author": "Divine Irisominabo",
    "text": "Nice speed review keep it coming 👍"
  },
  {
    "author": "Mr iOS ",
    "text": "Wait<br>Is the s23 ultra faster than the iPhone 12 Pro Max? 😂😂😂<br>I didn’t see that <br>Apple I love you 💕"
  },
  {
    "author": "José Adorno",
    "text": "Payed off my 12 Pro Max and got a Cream S23 Ultra, use both currently, don’t regret one bit!"
  },
  {
    "author": "mikldude",
    "text": "I have the 12 pro max and 14 pro max and a couple of older galaxys , looking at the differences between the 12 and 14 models  ,in general day to day use and general performance , i find much as you have shown here Nick , my old 12 pro max still performs like a beauty , and in my own speed test tests between the two , the difference more often than not for general use was imo very small , and i usually have 4 phones a macbook and ipad at my side , and when it comes to the iphones , im just as happy to pick up the 12 pro max as the newer 14 pro max , and i still prefer the notch to the island ..... just personal preference , but i do always carry the 14 whne i go somewhere , and when outside in the sun or in bright day light , the slightly more bright screen of the 14 pro max is a bit of a luxury  on the eyes , although the 12 was still quite decent .<br>  Given i dont game on phones , and really dont run them at the limit , i probably could have saved some coin and just stayed with the  old fathful 12 PM  ...... but wheres the fun in that :) ."
  },
  {
    "author": "Mike C",
    "text": "look at the battery 100% to 97% lol but still samsung is great. just not longevity."
  },
  {
    "author": "Dave Krska",
    "text": "I had an Iphone 12PM when they were launched and returned it because it was extremely glitchy...I ended up with a Note 20 I believe..."
  },
  {
    "author": "Khiuchamdinbo Pamai",
    "text": "Seeing through your video, I&#39;m in love with samsung❤"
  },
  {
    "author": "Murtaza Chaudhary",
    "text": "Very nice speed test review😀"
  },
  {
    "author": "Bit2Tek",
    "text": "I have both of these devices and happy with both.  Thanks for the comparison... enjoyed it ✌🏾"
  },
  {
    "author": "Davide De Pasquale",
    "text": "i think that when you make videos like this you should use a cover on every phone"
  },
  {
    "author": "Hayls World",
    "text": "🙌🏻 HEY GUYS 😁 Check out my website to download all the elements for the S-pen, as well as quotes on the home screen and call screen backgrounds 👉🏻 <a href=\"https://www.haylsworld.com/free-downloads/samsung-ultimate-customization\">https://www.haylsworld.com/free-downloads/samsung-ultimate-customization</a> ENJOY ✨"
  },
  {
    "author": "Disclaimer",
    "text": "What a quality video!"
  },
  {
    "author": "Stephan Bakun",
    "text": "Weird accent where you from?"
  },
  {
    "author": "Rocky Bigras",
    "text": "Yoooooooo!!!!!!!! What!!!! Thank you so much 💓 your so good too!"
  },
  {
    "author": "Re-Rider Suzanne",
    "text": "Really love the video, but you&#39;re going so fast! I wish you would slow down a bit."
  },
  {
    "author": "Mohammad Fallah",
    "text": "Will the Victus touch screen get scratched by finger touch in the long term?"
  },
  {
    "author": "Lorrie Anzaldúa",
    "text": "Hello,  I love your videos. The video calling option is missing from my S23 Ultra; can&#39;t make video calls through the phone dialer. How do I get it?"
  },
  {
    "author": "Vegas Wireman",
    "text": "I just bought a S23 Ultra up from a S8. A feature that I loved in the S8 was mirror casting. Is that gone from the S23 Ultra. Say it isn&#39;t so."
  },
  {
    "author": "Xavier",
    "text": "This is the best video I have watched on this. So subscribing"
  },
  {
    "author": "TheDddkkk",
    "text": "too big, samsung s10e is the last good phone. the s7 is even better except the micro usb port"
  },
  {
    "author": "Steve P",
    "text": "Just got my S23U....Thank you for this!"
  },
  {
    "author": "Zach",
    "text": "Where do I download the lumos sound?"
  },
  {
    "author": "Anwaruddin Zaifiandi",
    "text": "Why my s23 ultra doesn&#39;t have pause usb delivery battery? Can someone tell me why😢"
  },
  {
    "author": "Keith Van Der Wiele",
    "text": "How did you have the notes that look like posits on your home screen. That is so cool"
  },
  {
    "author": "Jose Gallegos",
    "text": "So much information instead of wasting time for the 10 minute marker 11 minutes of straight info"
  },
  {
    "author": "Decipher Code",
    "text": "This is better than the iphone, I&#39;m impressed with the improvements."
  },
  {
    "author": "AMIT SHARMA",
    "text": "What&#39;s the notes widget on you Home screen. It&#39;s pinned to the screen.<br>TIA"
  },
  {
    "author": "Sue Jemison",
    "text": "Best phone ever period"
  },
  {
    "author": "Mary Mary",
    "text": "Hi I interested on it how much the price"
  },
  {
    "author": "ScatPack Ty",
    "text": "That battery trick is definitely a great tip for playing games and getting the best out of the gpy"
  },
  {
    "author": "George SM",
    "text": ":)"
  },
  {
    "author": "Amir Amran",
    "text": "Its funny how reviewers are exciting to show spen features when in reality nobody even take the spen out of the phone. 99.9% of users buy the ultra for the better camera, bigger acreen, bigger battery, including me. Nobody wants to hold a pen, let alone spen. If you work with a pen then you&#39;re artist who uses pc or mac. The spen is bullshit marketing for reviewers to talk about."
  },
  {
    "author": "Jose",
    "text": "Dude nobody can understand what you&#39;re saying."
  },
  {
    "author": "Diogenes Zorrilla",
    "text": "Hayls, how can I turn on answer call automatically without using headset or any Bluetooth device..?"
  },
  {
    "author": "jasonxbox the 3rd",
    "text": "Just got the ultra, this vid helped out a lot! Ty"
  },
  {
    "author": "Lucian Catalin Ciolacu",
    "text": "👍👍👍"
  },
  {
    "author": "VENOM FF",
    "text": "Watching on s23 ultra"
  },
  {
    "author": "Engin Bozkurt",
    "text": "👏👏"
  },
  {
    "author": "Selene Rue",
    "text": "Not me watching in my S8 lol.  I can&#39;t let go but I do like the features of the newer ones"
  },
  {
    "author": "Lowla Starlexx",
    "text": "Loving your smart vibe 😂😂 2 months ago you encouraged me to buy Samsung pro 5 and that was worth it. Now I’ve got the exact phone your holding but in lavender. =)"
  },
  {
    "author": "kwl189",
    "text": "Fr I refused to buy and pay the same if not more than our US counterparts for Samsung phones that use crappy shitty Exynos processors. Literally even the software and camera algorithms are specifically different for the US and Korean markets which always without fail, get the very best SD processors and modems. <br><br>Now? I’m about to ditch my iPhone like a bad habit. Samsung biting their ego and pride has meant they’re worthy of the dough. <br><br>Well played Samsung."
  },
  {
    "author": "house of KZN",
    "text": "Can I please get your s22 ultra as my birthday present"
  },
  {
    "author": "stumpali",
    "text": "So best buy the S22 Ultra, yeah"
  },
  {
    "author": "Eduardo Arias",
    "text": "the freaking prices are getting ridiculous !!!"
  },
  {
    "author": "Trevor Williams",
    "text": "I just got the 23 ultra at $999 on best buy, best buy ever coming from s10 plus LOL"
  },
  {
    "author": "C Almeda",
    "text": "Please make a video of S23 vs. Pixel."
  },
  {
    "author": "rishi khumar",
    "text": "Nice"
  },
  {
    "author": "Sam",
    "text": "Funny cuase my mom just got it"
  },
  {
    "author": "Dharmendra Aghera",
    "text": "Rebuild. 😂"
  },
  {
    "author": "shashank gandhi",
    "text": "hi Arun, quick question..it seems you had a change of hear since you met Marquees and moved over to the iPhone :) ? It would be useful to share a more prolonged experience on s23 Ultra and let us know if you are tempted to switch back ?? Cheers!"
  },
  {
    "author": "Shahjada Fahim",
    "text": "IPhone boy complaining about boring ridiculous 😂 look how same iPhone  12 13 14 same 😂"
  },
  {
    "author": "Remi",
    "text": "Sad and desperate upgrade attempt over the S22 ultra that itself was a downgrade from note20 and even note 10plus i call it a downgrade because imagine my surprise to start an app i used on my note10 and 20 but it said not supported on new phone since it doesnt have a lidar sensor lol. And samsung stuck with the same design so the others can catch up! How about because it&#39;s cheaper, which seems seems to be samsung new motto."
  },
  {
    "author": "InvictusMortiss",
    "text": "this Channel sometimes looks like so the videos are been pre-paid off advertizement  but the unique sense of humor making it viral !"
  },
  {
    "author": "Richard",
    "text": "But the thing is its so expensive!"
  },
  {
    "author": "Dwayne Pionela",
    "text": "So which is which? There&#39;s no label"
  },
  {
    "author": "Travis Bowland",
    "text": "I just bought one...I dont know why, I probably use about 10% of its capability. like the pen though."
  },
  {
    "author": "K I N G",
    "text": "watching from my note 9"
  },
  {
    "author": "Brandon",
    "text": "Your explanation of pixel binning made more sense than anything else I’ve read about it 🎉"
  },
  {
    "author": "Bryant Floyd",
    "text": "200 megapixel ISOCELL HP1 sensor offers 200 million 0.64μm-sized pixels. Which are the smallest pixels in the world to date."
  },
  {
    "author": "eddie knight",
    "text": "Can you remove the bloatware"
  },
  {
    "author": "King Jerry Coleman IV",
    "text": "Alexa is still better than Bixby"
  },
  {
    "author": "LegendaryGamer5342",
    "text": "Bro to be honest you the king bro and u got all that money well done"
  },
  {
    "author": "ROBLOX GAME PAGE",
    "text": "And imagine s24 now ..."
  },
  {
    "author": "Arnold James Garcia",
    "text": "&quot;Why is the colors so boring?&quot;<br><br>Same question in my mind. Probably the worst colors on a smartphone. :("
  },
  {
    "author": "Drakme",
    "text": "I dont agree due to the crap os filled with garbage that is forced instead of choosing and few more reasons"
  },
  {
    "author": "Antonio Mossa",
    "text": "No, there is no secret to it"
  },
  {
    "author": "Ranjiv Chaitramsingh",
    "text": "Can u send me a s23 ultra"
  },
  {
    "author": "Mohamad Youssef",
    "text": "I don&#39;t see muchh of upgrade between s22 and s23, s22 was ambetter to use than s21 as I found it very buggy below expectations. But since I&#39;m offered a trade in value of $1250 AUD, same as new one on sale I&#39;ll upgrade for the heck of it. I think if your the type who males use of all the extras and is fanatical about how you use your phone then it&#39;s worth it. General users don&#39;t bother unless you need it. 😌  <br><br>I&#39;ve had the whole range of S series and Note series and I still liked my Huwai mate 20 pro more. It&#39;s more indestructible when it comes to damage and durability. <br><br>Every samsung I&#39;ve always shattered the screens. HTC used make durable and exceptional phones but don&#39;t know what happened to them <br><br>How Does this s23 ultra compare for gaming than the s22 ultra?"
  },
  {
    "author": "Reymond Ortega",
    "text": "They gave up on upgrading the design. ITS DEAD! NO AESTHETICS like IPHONE DOES. how Sad for New Innovations"
  },
  {
    "author": "Prince Dayani",
    "text": "You forgot the Ray Tracing"
  },
  {
    "author": "Angelo Draden Alba",
    "text": "I love it!!!"
  },
  {
    "author": "Ramkumar Sugumaran",
    "text": "I have s22 ultra and this is just a very minor upgrade. I think samsung must have put some more effort to atleast change the design. This is just complacency. Nobody must forget the fate of nokia"
  },
  {
    "author": "Francis Suemitsu 末光",
    "text": "Watching this on my A50S.<br><br>Sana all may pambili nito.😊"
  },
  {
    "author": "MRM",
    "text": "You&#39;ve forgotten one of the main features for the users outside the USA. S23 ultra offers a snapdragon chipset for customers all over the world, not that ridiculous Exynos anymore"
  },
  {
    "author": "Naveed Ahmed",
    "text": "<a href=\"https://www.youtube.com/watch?v=XUkV3RsjGrs&amp;t=5m45s\">5:45</a> what is that game?"
  },
  {
    "author": "Ranjiv Chaitramsingh",
    "text": "Can u send me a s23 ultra"
  },
  {
    "author": "Sinister Guest",
    "text": "Still no 2TB variant? Shame"
  },
  {
    "author": "Toallpoints West",
    "text": "Watching this on my Google Pixel 6 pro, Might have to buy a different one in the future"
  },
  {
    "author": "Ritesh rajput",
    "text": "Can anyone tell me Should I use S23 ultra global model in India"
  },
  {
    "author": "Oscar Castro",
    "text": "What&#39;s samsung record with software updates? I know it varies a lot by region or carrier, but most they get consistent updates in timely fashion? Ideally no later than a month?"
  },
  {
    "author": "Christopher Taylor",
    "text": "So tempted but I&#39;m just worried I&#39;m too used to smaller smsrtphones- I loved my Blackberry Passport, the last truly large phone I had. Maybe I will give this a go!"
  },
  {
    "author": "Tauhid Islam",
    "text": "gaming performance of s23 ultra is so much disappointing."
  },
  {
    "author": "Philip Warrillow",
    "text": "If it had a headphone jack I would buy one. I wonder if sennheiesr make a usb C HD650 ?"
  },
  {
    "author": "imran syed",
    "text": "I have an s9+ and I need to upgrade. My phone is 4 years old already. Should I go with s23 ultra or its predecessors s21 ultra or s22 ultra"
  },
  {
    "author": "Eric Kitzi",
    "text": "Max screen brightness is actually 1700nits with extra brightness turned on"
  },
  {
    "author": "Jon Am",
    "text": "I have been wanting to upgrade my Ultra 20 Note to 23 only for the camera. However, the photo comparison you displayed convinced me not to, since I found the portriat in the coffee shop not as detailed as the 22 and the lighting as good. Of course, I am on a world tour for the past 10 months and I have been very pleased with my pictures but am not too happy about the sharpness. Also, I am not happy that I won&#39;t be able to replace the Sim card since in some countries you must. Well, I can wait another year."
  },
  {
    "author": "niphanif",
    "text": "Bad cooling! Boooo"
  },
  {
    "author": "Don Omar Ramiro",
    "text": "<a href=\"https://www.youtube.com/watch?v=XUkV3RsjGrs&amp;t=9m08s\">9:08</a>... What is that tower over the mountain and why arent you using it to zoom?!?!?"
  },
  {
    "author": "Vert Beke",
    "text": "Keep it going Will !!"
  },
  {
    "author": "Vert Beke",
    "text": "Great review !!"
  },
  {
    "author": "MIDO ZAZA",
    "text": "Im watching this on my note 20 ultra 6.9 display"
  },
  {
    "author": "Kushal Das",
    "text": "Watching this on my Samsung Galaxy S23 Ultra 1 TB 🔥"
  },
  {
    "author": "gantswood",
    "text": "I have this beast and love her (Green/256gb/8gb ram). Previously I had the S21 Ultra 256GB."
  },
  {
    "author": "JJ SENSEI",
    "text": "Must be nice.......if only I had the money to get one."
  },
  {
    "author": "Eddie Zhang",
    "text": "looks color is off on screen though"
  },
  {
    "author": "Jermaine Kyle Caballes",
    "text": "Just upgraded from note9"
  },
  {
    "author": "Msharry Alyoubi",
    "text": "What name of the game at <a href=\"https://www.youtube.com/watch?v=XUkV3RsjGrs&amp;t=6m16s\">6:16</a> ?"
  },
  {
    "author": "Melo Bautista",
    "text": "More focused on Will&#39;s arms HAHA"
  },
  {
    "author": "Lester C. Arnesto",
    "text": "Is it ok to use 30 watts fast charging to s23 ultra?"
  },
  {
    "author": "Lion Heart.",
    "text": "Im torn between this and vivo x80 pro."
  },
  {
    "author": "Vinh Xô",
    "text": "► Mua Samsung Galaxy S23 Ultra với giá từ 26,9 triệu đồng: <a href=\"https://cellphones.com.vn/samsung-galaxy-s23-ultra.html?utm_source=pr&amp;utm_medium=VinhXo&amp;utm_campaign=samsung-galaxy-s23-ultra.html_18042023\">https://cellphones.com.vn/samsung-galaxy-s23-ultra.html?utm_source=pr&amp;utm_medium=VinhXo&amp;utm_campaign=samsung-galaxy-s23-ultra.html_18042023</a><br><br>► Nghỉ lễ dài lâu, Phụ kiện giảm sâu đến 32%, giá chỉ từ 150.000đ: <a href=\"https://cellphones.com.vn/khuyen-mai-30-4?utm_source=pr&amp;utm_medium=VinhXo&amp;utm_campaign=khuyen-mai-30-4_18042023\">https://cellphones.com.vn/khuyen-mai-30-4?utm_source=pr&amp;utm_medium=VinhXo&amp;utm_campaign=khuyen-mai-30-4_18042023</a>"
  },
  {
    "author": "Hiếu Phạm",
    "text": "Xem phim gì mà 18+ z"
  },
  {
    "author": "Đạt Nguyễn",
    "text": "Anh em cho mình hỏi là mình đang dùng bản 8- 256 bây giờ muốn lên bản 12 - 512 thì thêm tầm bao nhiêu củ ?"
  },
  {
    "author": "Suu Phan Xuan",
    "text": "Đang dùng N20u ngon lành cành đào ss pay chạy pà pà. Lên đời s23u tự nhiễn ss pay tịt luôn. Không add được  thẻ vào nữa. Đang căm thù s23u đây"
  },
  {
    "author": "Napoleone Ponaparte",
    "text": "Video này chất lượng đúng của điện thoại quay luôn"
  },
  {
    "author": "TuDoi",
    "text": "<a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a>"
  },
  {
    "author": "hokage obito",
    "text": "có nên đổi từ s22u lên không a nhỉ"
  },
  {
    "author": "TuDoi",
    "text": "Lêu lêu mấy anh em không có sticker <a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a>"
  },
  {
    "author": "Mình Bị Ảo Ma Canada",
    "text": "Oppo quay vid này chi tiết ổn trừ cái mặt ông vinh thôi, thu âm thì thôi : TỆ vãi. Dùng tablet bật cả Dolby vẫn k thể nghe nổi, max âm thì nghe mới ổn được"
  },
  {
    "author": "anh duc",
    "text": "review chất"
  },
  {
    "author": "MT Media",
    "text": "Xin tên món đồ chơi nam châm ở <a href=\"https://www.youtube.com/watch?v=vF1w05RotNk&amp;t=5m17s\">5:17</a> với Vinh đẹp chai ơiiiiii"
  },
  {
    "author": "Trường Nguyễn Văn",
    "text": "Hóng phim hoạt hình ở phút <a href=\"https://www.youtube.com/watch?v=vF1w05RotNk&amp;t=6m26s\">6:26</a> 😂"
  },
  {
    "author": "Vinh Nguyễn",
    "text": "Thu âm vang thế nhỉ, ko nhìn thấy mặt rỗ của thằng em Vinh"
  },
  {
    "author": "Lê Hải Đăng",
    "text": "Đang dùng bản 12gb ram, mở app tè le ra nó cũng chả bao giờ lag trong khi điều đó là ko thể với s22u năm ngoái. Pin rất ngon, cứ ngày sạc 1 lần quá sướng. 😊"
  },
  {
    "author": "Phương Nguyễn",
    "text": "chất lượng thu âm kém quá sếp ạ"
  },
  {
    "author": "Nguyên Nhi",
    "text": "Bác Ngồi dưới giếng Review à"
  },
  {
    "author": "Kyzer X",
    "text": "Bao giờ không nghĩ ra điểm nâng cấp gì thì mới đẩy nâng cấp vào pin và sạc, vậy thì mới hút máu được."
  },
  {
    "author": "Tâm Nguyễn",
    "text": "Sạc nhanh làm PIN quá nhiệt .PIN nhanh hỏng hóc hơn"
  },
  {
    "author": "Ngô Huy",
    "text": "Thôi tầm giá này hóng mi13ultra thôi chứ con này chả có j nổi bật quá bình thường"
  },
  {
    "author": "Bảo Quốc",
    "text": "Nói chung ông Vinh xô dạo gần đây &quot;dìm hàng&quot; S23 Ultra hơi nhiều😅 thẳng thắn ra là khi nào các ui khác của tàu làm trải nghiệm hàng ngày nó quen thuộc đi thì mấy ra mới ăn lại, chứ máy thì chỉ hoặc cam khủng hoặc máy sạc nhanh sấm sét thì vẫn lệch quá😊"
  },
  {
    "author": "Toàn Nguyễn",
    "text": "Con Oppo này quay sếp Vinh nhìn đẹp trai z:))"
  },
  {
    "author": "Trung Hà",
    "text": "Mình đang dùng Note 20 Ultra và IP12 pro khá hài lòng"
  },
  {
    "author": "Đạt Hoàng",
    "text": "Đang muốn mua mà ko biết chọn con nào được ss hay ip đây"
  },
  {
    "author": "Xuantruong Vu",
    "text": "Ae cho hỏi xau các máy sámung vừa cập nhật phần mềm dc mấy hôm nó lại báo cập nhật tiếp là thế nào nhỉ"
  },
  {
    "author": "SANG LEE",
    "text": "quay oppo có khác , mặt ko thấy rỗ của Vinh Xô luôn"
  },
  {
    "author": "Trung Nguyen",
    "text": "Find X6 pro quay chán thế Vinh ơi. Nhìn bết bền bệt, chi tiết vùng tối mất hoàn toàn luôn."
  },
  {
    "author": "Vũ Ngọc",
    "text": "Mở đầu video đã thấy mặt sếp vinh mịn bóng như sơn tùng là đã đoán quay bằng android, ai ngờ quay đúng bằng oppo luôn"
  },
  {
    "author": "Nothing",
    "text": "Có laptop nào tầm giá 10 13tr để giải trí nhẹ giới thiệu tui ae ơi."
  },
  {
    "author": "ดวงดี นามนวล",
    "text": "respeack nhe ae"
  },
  {
    "author": "AT Trịnh",
    "text": "S22u mình càng cập nhật, thấy sạc chậm đi😭 dù bậc sạc siêu nhanh cũng chả khác biệt gì so với sạc nhanh."
  },
  {
    "author": "Shane Symonds",
    "text": "Get up to $150 off, a free memory upgrade, and $600 trade in credit with this exclusive preorder link➡ <a href=\"https://howl.me/ci2mxUsIljZ\">https://howl.me/ci2mxUsIljZ</a><br>What are your thoughts on the S23 Ultra? Thanks for watching!"
  },
  {
    "author": "Mohammad Fallah",
    "text": "Will the Victus touch screen get scratched by finger touch in the long term?"
  },
  {
    "author": "BigSkylar",
    "text": "The 1TB is exclusive to Samsung&#39;s website and its Factory Unlocked."
  },
  {
    "author": "Drifting Forward ",
    "text": "DO you have to use the fingerprint or face rec?"
  },
  {
    "author": "neil legg",
    "text": "Hiya shane I just watched your video on the unboxing of the Galaxy s23 ultra. I do like the camra set up. But I&#39;m a bit confus3d with with cameras. My question how do I know when I&#39;m using thevl 200mpx camra.? And as for the rest of the phone pressing brillent. I am coming from the sameung galaxy s20 <a href=\"http://ultra.now/\">ultra.now</a> to galaxy s23 ultra. And I got 512GB. VERSION.BECOSE OF THAT. Camra. And the lack of the sd card unlike my last phone"
  },
  {
    "author": "Ripple CEO",
    "text": "I cannot afford it!!!!"
  },
  {
    "author": "Joshua Wright",
    "text": "So I want to make the switch to Samsung from Apple would it be a could idea because I see a lot of awesome features with Samsung"
  },
  {
    "author": "Ball.Enough",
    "text": "What do u do with all the other phones you&#39;ve unboxed????"
  },
  {
    "author": "ii aM NuGe x",
    "text": "Shane plays OSRS! I noticed that icon, what&#39;s your username?"
  },
  {
    "author": "Prince Erick",
    "text": "iPhone Forever❤<br>Can&#39;t even FaceTime lmfao"
  },
  {
    "author": "⚜️ Say What Now ⚜️",
    "text": "I compared them in person because I have the s22 and I found absolutely no difference in quality, performance, sound, except for the camera is no joke the only difference and honestly if people are that worried about a camera than humanity is doomed. And the battery in the s22 is just fine for me but that could be because I actually have a life and dnt spend my life time staring at a screen all day long."
  },
  {
    "author": "Gregg Polka",
    "text": "S23 ultra is the best phone ever 📱"
  },
  {
    "author": "reloader523",
    "text": "Finally found a regular guy doing a review that doesn&#39;t have all kinds of statistics and information that is useless to us looking forward to more reviews"
  },
  {
    "author": "awesome people",
    "text": "Samsung S23 super premium smartphone 2023.Super camera.super processor the best things the best camera..8K video recording on s23."
  },
  {
    "author": "Mr.Cobanoglu",
    "text": "Thank you for showing all the details and for the review, I had a question about this device, are the top and bottom bezels of the screen perfectly level or is the bottom bezel thick?"
  },
  {
    "author": "Rizwan Pervaiz",
    "text": "do you use iphone to record these videos?"
  },
  {
    "author": "Dari Lensa Harith Ariffin",
    "text": "I hope can afford it this year"
  },
  {
    "author": "Bruno Franco Beltran Guevara",
    "text": "wich model is SM-S918UZGAXAA, SM-S918U or SM-S918U1"
  },
  {
    "author": "BreadTank",
    "text": "i just got the s23 ultra in phantom black such a sick phone glad i got it :)"
  },
  {
    "author": "𝓚𝓾𝓫𝓪𝓷𝓜𝓪𝓯𝓲𝓪",
    "text": "Verizon give me 800$ for my beautiful note10+ trade for S23u , battery is awesome like I get 8h+ on screen use with 85 battery"
  },
  {
    "author": "Samzilla",
    "text": "Why do some s23 ultras have the IMEI number  on the back while others don&#39;t"
  },
  {
    "author": "George Brophy",
    "text": "i wood like to know is the samsung galaxy s23 ultra a better phone than the samsung galaxy s20"
  },
  {
    "author": "HEART KILLER",
    "text": "I m playing runscape any help u need tell me"
  },
  {
    "author": "HEART KILLER",
    "text": "Bro u play runacape game"
  },
  {
    "author": "Emanuel Vega",
    "text": "BOREING!!!!!!!"
  },
  {
    "author": "dodi dodi",
    "text": "🛑🛑🛑do not buy it Because no one will till you about the heating problem in this phone that nothing can fix Save your money"
  },
  {
    "author": "Chris James",
    "text": "Apple wont be worried...normal Android tosh"
  },
  {
    "author": "Boddhi Bo",
    "text": "WELL SAID iPhone is a joke but not in 2023 it is a joke since iPhone X."
  },
  {
    "author": "Joachim Asperin",
    "text": "Hope to get one"
  },
  {
    "author": "CONTEMN",
    "text": "enojy your bloatware..."
  },
  {
    "author": "Imam Tegal",
    "text": "Alhamdulillah sudah kebeli ☺☺☺<br>Bukan HPnya ya, sy cumn bilng alhamdulillah sudh kebeli, cumn ngetik doang. ☺"
  },
  {
    "author": "Rizky Fariska Ismail",
    "text": "Hayo siapa yg udah kena green line cunggg 😂"
  },
  {
    "author": "༆Nanda Ftܔ",
    "text": "Bng itu bener ga samsung s24 ultra udah ada, tapi ko desainnya beda&quot;"
  },
  {
    "author": "boneng merchandise",
    "text": "Hp impian😅😅😅😅"
  },
  {
    "author": "Dani Sutrisno",
    "text": "Pengen beli HP ini tapi apa daya pemerintah gamau belikan 🤣🤣🤣"
  },
  {
    "author": "Sigit Raharjo",
    "text": "Dengerin sampai mau abis ko aku tetap gak faham apa yg di bahas cuman yg saya tangkap hp satu dengan hanya yg satunya ada beda gak banyak"
  },
  {
    "author": "wldnnn",
    "text": "<a href=\"https://www.youtube.com/watch?v=zTDsP2P_Qfk&amp;t=3m00s\">3:00</a>"
  },
  {
    "author": "Nanda Lucius",
    "text": "My dream smartphone! Kepikiran mulu sampe kebawa mimpi. Semoga tahun ini akhirnya kebeli"
  },
  {
    "author": "hayolo mauapa",
    "text": "menurutku Cover Screen z flip 4 ( layar kecil di bagian belakang ) harus di turunkan ke Galaxy S24 nanti dan seterusnya karena bisa menjadi fitur yang sangat berguna untuk vloger atau pun konten kreator."
  },
  {
    "author": "Sean Shan",
    "text": "kok saya pake flip 3 snap 888, kok cepet panas ya, kayak serasa body hpnya bs masak telor"
  },
  {
    "author": "RA.Elpri Purnamajanti",
    "text": "Harganya brp ya S23 ultra"
  },
  {
    "author": "Pahri Anang",
    "text": "Wow"
  },
  {
    "author": "Ur S",
    "text": "s23 ultra ama ip 14 promax bagus mana"
  },
  {
    "author": "Bring Mirham",
    "text": "22Jt ,, ngeliat review di getok,, di gesek gituuu...<br><br><br>GEELLLLIIII"
  },
  {
    "author": "Dwi Pratikto",
    "text": "S 22 ultra aj dah cukup mumpuni, klo lgsung naik di S 23 ultra trlalu nanggung..nnti aja S 24 or S 25 , makin kerasa feel up nya"
  },
  {
    "author": "Fariz Azwar Azmi",
    "text": "Ada yang pakai hp ini terus pas vidcall WA kameranya burem di tempat gelap? Apa ya solusinya.<br>Saya sebelumnua pakai mi note 10 pro malah jauh lebih jernih dibanding sekarang."
  },
  {
    "author": "Ari Jonathan Chandra",
    "text": "Kamis 6 April jam setengah 12 malem nonton video ini, dalem hati cuman mikir &quot;kapan ya bisa punya hp flagship, Tuhan, kalo boleh, pengen deh punya&quot;<br><br>Jumat 7 April sepulang gereja habis Jum&#39;at Agung, jam 4 sore ke Central Park, ga tau nya lagi ada event Galaxy Land dan ketika nanya proses trade in, ternyata Samsung A72 ku yang usia nya udah 2 tahun dan dulu aku beli di harga 6,6 juta di hargain in total dengan promo jadi 5,6 buat motong harga Samsung Galaxy S23 Ultra, dan karena uda nonton review nya di channel GadgetIn, ga pake pikir panjang, langsung gas, and I think this my best buy of 2023.<br><br>Thank you David and GadgetIn Team for producing quality content like this! Oh iya congrats on your new born baby , David!"
  },
  {
    "author": "by",
    "text": "Di next test gaming di hp manapun wajib cobain game baru dari tencent ACE RACER keren bat itu game dan lumayan berat jg 🎉"
  },
  {
    "author": "Jokast88",
    "text": "KOK GA ADA REVIEW S23??"
  },
  {
    "author": "Refgiansho",
    "text": "Itu di jual kembali kah bang"
  },
  {
    "author": "Wagatsinger Nn",
    "text": "Mksh bang david sukses sllu,dgn chanel ini aku bsa tau mana hp yg layak buat saya beli"
  },
  {
    "author": "Kris Tian",
    "text": "Harganya berapa bang?"
  },
  {
    "author": "Daniel Ginting",
    "text": "Puji Tuhan Hp S 23 Ultranya sudah kebelik,teri.akasi buat istriku tercinta sudah memberikan kado ultah."
  },
  {
    "author": "Muhammad Syaiful",
    "text": "Oke nonton dulu, soalnya skrg duitnya masih cukup buat beli susu ultra"
  },
  {
    "author": "Tanjakan Turunan",
    "text": "Next beli lah nunggu harga turun dikit, sementara pake j2 prime dulu"
  },
  {
    "author": "Kingers Abalabal",
    "text": "Izin tanya bang. Samsung s23 ultra Made in Korea apakah sama saja bang.<br>Terimakasih"
  },
  {
    "author": "Rudy Eko",
    "text": "Warna favorit apa ya"
  },
  {
    "author": "Badudt'h Liar",
    "text": "Bang coba donk, review Hp Samsung S23 ultra sama Aiphone 14 pro Max,, di tunggu yaah<br>Pengen tau mana yg unggul,, 😅"
  },
  {
    "author": "Nurul aini Siti",
    "text": "Yg mau jual hp second sni"
  },
  {
    "author": "Akmal Anbiya",
    "text": "Lu punya hp berapa bang"
  },
  {
    "author": "ArthropodSpidey",
    "text": "How to be Australian: say Whilst a lot"
  },
  {
    "author": "FORMOSTV RECODE",
    "text": "man, u need 2 months to realise camera not good<br>i sold my s23 1-2 days after purchasing it 😂 can&#39;t deal with grainy images after all, very artificial results"
  },
  {
    "author": "Bineesh Balachandran",
    "text": "Which launcher are you using?"
  },
  {
    "author": "Nitesh Apte",
    "text": "If you are more into mobile videography, go for s23 Ultra. But if you are more into photography, s22 Ultra pictures including night mode pictures are much better than s23 Ultra. I own s22 Ultra and recently got s23 Ultra too. After doing image and video comparison, I found s22 Ultra images are less grainy, sharper (less sharp after April update), more clear, basically overall better than s23 Ultra. But in s23 Ultra colours are more accurate, especially skin tones, sky colours, reds are very close to natural colour. The videos are definitely better than s22 Ultra. Surprisingly, shadow areas are grainier in pictures, but video of the same shadow areas has no grains in s23 Ultra. And obviously no grains in s22 Ultra. After April update, selfie video quality has improved a lot in s22 Ultra. So, overall s22 Ultra is more stable in terms of camera performance. Upgrading to s23 Ultra from s22 Ultra is a waste of money unless you are more into mobile videography than photography."
  },
  {
    "author": "Hamad Warraich",
    "text": "Watch from pakistan 🇵🇰 dude"
  },
  {
    "author": "renaldo friloux",
    "text": "Just say your an apple fan why don&#39;t u"
  },
  {
    "author": "Damien Lobb",
    "text": "What do you think of the improved speakers? I do find consuming content is more enjoyable now."
  },
  {
    "author": "Ddd Bbb",
    "text": "best phone I have ever purchased and best battery and fast charging with smooth performance 👌"
  },
  {
    "author": "Muhammad Bin American",
    "text": "This guy has mastered phone reviews."
  },
  {
    "author": "Apurv Jyotirmay",
    "text": "Damn! That chin is so huge! OMG! Can&#39;t believe Samsung is still stuck in effing 1990s!"
  },
  {
    "author": "HP",
    "text": "please add this video to your Samsung playlist"
  },
  {
    "author": "Ranjiv Chaitramsingh",
    "text": "Can u send me a s23 ultra"
  },
  {
    "author": "TheSaint135",
    "text": "Best review ever"
  },
  {
    "author": "Sanjay ram",
    "text": "Can anyone tell me how to take portrait video in front facing camera?"
  },
  {
    "author": "Yawning Deer",
    "text": "My S23 Ultra doesnt make it the full day. Comes really close, but if you  take a lot of videos and photos and watch a lot of Youtube,   or in general a heavy user, be warned. I generally rate this guy but there are a lot a variables. If he has two phones in his pockets and use both or if he uses only the FHD and 60hz settings, yes I can see why he gets more battery life. Disappointed about the wishy washy style of explaining features like battery life without explaining constraints or references so its a more analytical approach to testing said features."
  },
  {
    "author": "Amr Nada",
    "text": "@ <a href=\"https://www.youtube.com/watch?v=uhQgPBKhVq0&amp;t=7m17s\">7:17</a> .. FINALLY SOMEONE SAID IT! That&#39;s ALWAYS what I felt while using a Samsung phone and I did stop buying Samsung&#39;s phones cause of that exact reason."
  },
  {
    "author": "Jevon Bhagaloo",
    "text": "We need that customisation video, your theme looks great!"
  },
  {
    "author": "Navneet Jain",
    "text": "Would you kindly recommend an app lock with minimal UI and Material You theming?"
  },
  {
    "author": "Angelo Arriola",
    "text": "God your accent is so sexy."
  },
  {
    "author": "Ayaan Shrestha",
    "text": "Love your videos mate, <br>Also do make a review video on the base s23"
  },
  {
    "author": "Rez",
    "text": "I hate the s-pen and the square corners... s pen I never use and yet it keeps un-popping and I have to put it back in....."
  },
  {
    "author": "Vedavyawhss • వేదవ్యాస్",
    "text": "Phone was just perfect like Bruce Lee 💖😎"
  },
  {
    "author": "Brigthanie Cuestas",
    "text": "how about the battery? I got samsung s23 ultra, then when I am using 4 hours consecutively, my battery percentage from 85% will go down to 50%. is it normal?"
  },
  {
    "author": "Fawad",
    "text": "No one is talking about the production qualify"
  },
  {
    "author": "Christopher Holden",
    "text": "Here in the uk I wouldn’t call it the same phone with worse battery the exynos chip in my s22 ultra was shit and the battery life was terrible I ended up selling it and moving to pixel 7 pro I’ve since moved to the s23 ultra and everything about it is hundred percent better than the S 22 ultra"
  },
  {
    "author": "asdfghjkljhgfdsaable",
    "text": "Love your work Sam. <br><br>S23 Ultra is out of budget but would you say second hand S22 Ultra or even S21 Ultra (both imported for Snapdragon chipsets) would be worthwhile in 2023? Given what you&#39;ve said about 5.1 I&#39;m wondering if they could be back on the table...<br><br>Thanks in advance if you see this"
  },
  {
    "author": "Piyush Choudhary",
    "text": "Samsung really needs to improve when it&#39;s live photos are activated. If you turn it on, every photo is live photo even when you and/or the scene was pretty still."
  },
  {
    "author": "iyerviking",
    "text": "What is the wallpaper at <a href=\"https://www.youtube.com/watch?v=uhQgPBKhVq0&amp;t=2m21s\">2:21</a>? Also Sam, where are you getting all these wallpapers from? They look very elegant and simple."
  },
  {
    "author": "Bruce Klein",
    "text": "No idea what chin on the bottom of the s23 U you are talking about and no other creator has ever mention it."
  },
  {
    "author": "Viliam Beňa",
    "text": "so how does the camera stacks up against iPhone 14 pro max in videos , photos, point and shoot reliability, colors , skin tones ?"
  }
]